*** crates/s4logs-core/src/chunk.rs:103:9: replace ChunkWriter::is_empty -> bool with false

*** mutation diff:
--- crates/s4logs-core/src/chunk.rs
+++ replace ChunkWriter::is_empty -> bool with false
@@ -95,17 +95,17 @@
             original_off: 0,
             record_count: 0,
             min_ts: i64::MAX,
             max_ts: i64::MIN,
         }
     }
 
     pub fn is_empty(&self) -> bool {
-        self.record_count == 0 && self.pending_records == 0
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Total uncompressed bytes accepted so far (flush-threshold signal for
     /// the gateway buffer).
     pub fn uncompressed_len(&self) -> u64 {
         self.original_off + self.pending.len() as u64
     }

*** result: Success
