*** crates/s4logs-core/src/chunk.rs:113:27: replace + with - in ChunkWriter::record_count

*** mutation diff:
--- crates/s4logs-core/src/chunk.rs
+++ replace + with - in ChunkWriter::record_count
@@ -105,17 +105,17 @@
 
     /// Total uncompressed bytes accepted so far (flush-threshold signal for
     /// the gateway buffer).
     pub fn uncompressed_len(&self) -> u64 {
         self.original_off + self.pending.len() as u64
     }
 
     pub fn record_count(&self) -> u64 {
-        self.record_count + self.pending_records
+        self.record_count - /* ~ changed by cargo-mutants ~ */ self.pending_records
     }
 
     pub fn push(&mut self, rec: &LogRecord) -> Result<(), ChunkError> {
         rec.append_jsonl(&mut self.pending)?;
         self.pending_min_ts = self.pending_min_ts.min(rec.timestamp);
         self.pending_max_ts = self.pending_max_ts.max(rec.timestamp);
         self.pending_records += 1;
         if self.pending.len() >= self.cfg.frame_target_bytes {

*** result: Success
