*** crates/s4logs-core/src/chunk.rs:120:30: replace += with -= in ChunkWriter::push

*** mutation diff:
--- crates/s4logs-core/src/chunk.rs
+++ replace += with -= in ChunkWriter::push
@@ -112,17 +112,17 @@
     pub fn record_count(&self) -> u64 {
         self.record_count + self.pending_records
     }
 
     pub fn push(&mut self, rec: &LogRecord) -> Result<(), ChunkError> {
         rec.append_jsonl(&mut self.pending)?;
         self.pending_min_ts = self.pending_min_ts.min(rec.timestamp);
         self.pending_max_ts = self.pending_max_ts.max(rec.timestamp);
-        self.pending_records += 1;
+        self.pending_records -= /* ~ changed by cargo-mutants ~ */ 1;
         if self.pending.len() >= self.cfg.frame_target_bytes {
             self.cut_frame()?;
         }
         Ok(())
     }
 
     fn cut_frame(&mut self) -> Result<(), ChunkError> {
         if self.pending.is_empty() {

---- chunk::tests::multi_frame_cut_and_concatenated_decode stdout ----

thread 'chunk::tests::multi_frame_cut_and_concatenated_decode' (1900612) panicked at crates/s4logs-core/src/chunk.rs:120:9:
attempt to subtract with overflow

---- read::tests::bomb_cap_stops_decoding_early stdout ----

thread 'read::tests::bomb_cap_stops_decoding_early' (1900618) panicked at crates/s4logs-core/src/chunk.rs:120:9:
attempt to subtract with overflow

---- read::tests::mismatched_sidecars_rejected stdout ----

thread 'read::tests::mismatched_sidecars_rejected' (1900621) panicked at crates/s4logs-core/src/chunk.rs:120:9:
attempt to subtract with overflow

failures:
    chunk::tests::encode_does_not_consume_and_matches_finish
    chunk::tests::multi_frame_cut_and_concatenated_decode
    chunk::tests::single_frame_roundtrips_via_plain_zstd
    read::tests::bomb_cap_stops_decoding_early
    read::tests::coalesce_merges_adjacent_frames
    read::tests::mismatched_sidecars_rejected
    read::tests::prune_then_decompress_selected_frames
    read::tests::undersized_claim_within_cap_rejected_as_size_mismatch
    sink::tests::memory_sink_stores_data_and_stamped_sidecars
    store::tests::put_chunk_data_failure_skips_sidecars
    store::tests::put_chunk_sidecar_failure_surfaces
    store::tests::put_chunk_storage_class_applies_to_data_object_only

test result: FAILED. 25 passed; 14 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
