*** crates/s4logs-core/src/chunk.rs:120:30: replace += with *= in ChunkWriter::push

*** mutation diff:
--- crates/s4logs-core/src/chunk.rs
+++ replace += with *= in ChunkWriter::push
@@ -112,17 +112,17 @@
     pub fn record_count(&self) -> u64 {
         self.record_count + self.pending_records
     }
 
     pub fn push(&mut self, rec: &LogRecord) -> Result<(), ChunkError> {
         rec.append_jsonl(&mut self.pending)?;
         self.pending_min_ts = self.pending_min_ts.min(rec.timestamp);
         self.pending_max_ts = self.pending_max_ts.max(rec.timestamp);
-        self.pending_records += 1;
+        self.pending_records *= /* ~ changed by cargo-mutants ~ */ 1;
         if self.pending.len() >= self.cfg.frame_target_bytes {
             self.cut_frame()?;
         }
         Ok(())
     }
 
     fn cut_frame(&mut self) -> Result<(), ChunkError> {
         if self.pending.is_empty() {

---- chunk::tests::single_frame_roundtrips_via_plain_zstd stdout ----

thread 'chunk::tests::single_frame_roundtrips_via_plain_zstd' (1908004) panicked at crates/s4logs-core/src/chunk.rs:253:9:
assertion `left == right` failed
  left: 0
 right: 2

---- chunk::tests::encode_does_not_consume_and_matches_finish stdout ----

thread 'chunk::tests::encode_does_not_consume_and_matches_finish' (1908002) panicked at crates/s4logs-core/src/chunk.rs:279:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    chunk::tests::encode_does_not_consume_and_matches_finish
    chunk::tests::single_frame_roundtrips_via_plain_zstd

test result: FAILED. 37 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
