*** crates/s4logs-core/src/chunk.rs:142:27: replace += with -= in ChunkWriter::cut_frame

*** mutation diff:
--- crates/s4logs-core/src/chunk.rs
+++ replace += with -= in ChunkWriter::cut_frame
@@ -134,17 +134,17 @@
             original_size: self.pending.len() as u64,
             compressed_offset: self.body.len() as u64,
             compressed_size: compressed.len() as u64,
         });
         self.ts_entries.push(TsEntry {
             min_ts: self.pending_min_ts,
             max_ts: self.pending_max_ts,
         });
-        self.original_off += self.pending.len() as u64;
+        self.original_off -= /* ~ changed by cargo-mutants ~ */ self.pending.len() as u64;
         self.body.extend_from_slice(&compressed);
         self.record_count += self.pending_records;
         self.min_ts = self.min_ts.min(self.pending_min_ts);
         self.max_ts = self.max_ts.max(self.pending_max_ts);
         self.pending.clear();
         self.pending_min_ts = i64::MAX;
         self.pending_max_ts = i64::MIN;
         self.pending_records = 0;

---- read::tests::undersized_claim_within_cap_rejected_as_size_mismatch stdout ----

thread 'read::tests::undersized_claim_within_cap_rejected_as_size_mismatch' (1936925) panicked at crates/s4logs-core/src/chunk.rs:142:9:
attempt to subtract with overflow

---- read::tests::bomb_cap_stops_decoding_early stdout ----

thread 'read::tests::bomb_cap_stops_decoding_early' (1936910) panicked at crates/s4logs-core/src/chunk.rs:142:9:
attempt to subtract with overflow

---- read::tests::mismatched_sidecars_rejected stdout ----

thread 'read::tests::mismatched_sidecars_rejected' (1936913) panicked at crates/s4logs-core/src/chunk.rs:142:9:
attempt to subtract with overflow

failures:
    chunk::tests::multi_frame_cut_and_concatenated_decode
    read::tests::bomb_cap_stops_decoding_early
    read::tests::coalesce_merges_adjacent_frames
    read::tests::mismatched_sidecars_rejected
    read::tests::prune_then_decompress_selected_frames
    read::tests::undersized_claim_within_cap_rejected_as_size_mismatch

test result: FAILED. 33 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
