*** crates/s4logs-core/src/chunk.rs:142:27: replace += with *= in ChunkWriter::cut_frame

*** mutation diff:
--- crates/s4logs-core/src/chunk.rs
+++ replace += with *= in ChunkWriter::cut_frame
@@ -134,17 +134,17 @@
             original_size: self.pending.len() as u64,
             compressed_offset: self.body.len() as u64,
             compressed_size: compressed.len() as u64,
         });
         self.ts_entries.push(TsEntry {
             min_ts: self.pending_min_ts,
             max_ts: self.pending_max_ts,
         });
-        self.original_off += self.pending.len() as u64;
+        self.original_off *= /* ~ changed by cargo-mutants ~ */ self.pending.len() as u64;
         self.body.extend_from_slice(&compressed);
         self.record_count += self.pending_records;
         self.min_ts = self.min_ts.min(self.pending_min_ts);
         self.max_ts = self.max_ts.max(self.pending_max_ts);
         self.pending.clear();
         self.pending_min_ts = i64::MAX;
         self.pending_max_ts = i64::MIN;
         self.pending_records = 0;

---- read::tests::coalesce_merges_adjacent_frames stdout ----

thread 'read::tests::coalesce_merges_adjacent_frames' (1949003) panicked at crates/s4logs-core/src/read.rs:303:9:
assertion `left == right` failed
  left: 6987
 right: 70

---- chunk::tests::multi_frame_cut_and_concatenated_decode stdout ----

thread 'chunk::tests::multi_frame_cut_and_concatenated_decode' (1948992) panicked at crates/s4logs-core/src/chunk.rs:307:9:
assertion `left == right` failed
  left: 15780
 right: 0

failures:
    chunk::tests::multi_frame_cut_and_concatenated_decode
    read::tests::coalesce_merges_adjacent_frames

test result: FAILED. 37 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
