*** crates/s4logs-core/src/chunk.rs:144:27: replace += with -= in ChunkWriter::cut_frame

*** mutation diff:
--- crates/s4logs-core/src/chunk.rs
+++ replace += with -= in ChunkWriter::cut_frame
@@ -136,17 +136,17 @@
             compressed_size: compressed.len() as u64,
         });
         self.ts_entries.push(TsEntry {
             min_ts: self.pending_min_ts,
             max_ts: self.pending_max_ts,
         });
         self.original_off += self.pending.len() as u64;
         self.body.extend_from_slice(&compressed);
-        self.record_count += self.pending_records;
+        self.record_count -= /* ~ changed by cargo-mutants ~ */ self.pending_records;
         self.min_ts = self.min_ts.min(self.pending_min_ts);
         self.max_ts = self.max_ts.max(self.pending_max_ts);
         self.pending.clear();
         self.pending_min_ts = i64::MAX;
         self.pending_max_ts = i64::MIN;
         self.pending_records = 0;
         Ok(())
     }

---- read::tests::prune_then_decompress_selected_frames stdout ----

thread 'read::tests::prune_then_decompress_selected_frames' (1953796) panicked at crates/s4logs-core/src/chunk.rs:144:9:
attempt to subtract with overflow

---- read::tests::coalesce_merges_adjacent_frames stdout ----

thread 'read::tests::coalesce_merges_adjacent_frames' (1953793) panicked at crates/s4logs-core/src/chunk.rs:144:9:
attempt to subtract with overflow

---- read::tests::mismatched_sidecars_rejected stdout ----

thread 'read::tests::mismatched_sidecars_rejected' (1953795) panicked at crates/s4logs-core/src/chunk.rs:144:9:
attempt to subtract with overflow

failures:
    chunk::tests::multi_frame_cut_and_concatenated_decode
    read::tests::bomb_cap_stops_decoding_early
    read::tests::coalesce_merges_adjacent_frames
    read::tests::mismatched_sidecars_rejected
    read::tests::prune_then_decompress_selected_frames
    read::tests::undersized_claim_within_cap_rejected_as_size_mismatch

test result: FAILED. 33 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
