*** crates/s4logs-core/src/chunk.rs:172:12: delete ! in ChunkWriter::encode

*** mutation diff:
--- crates/s4logs-core/src/chunk.rs
+++ delete ! in ChunkWriter::encode
@@ -164,17 +164,17 @@
     pub fn encode(&self) -> Result<Option<EncodedChunk>, ChunkError> {
         let mut entries = self.entries.clone();
         let mut ts_entries = self.ts_entries.clone();
         let mut body = self.body.clone();
         let mut original_off = self.original_off;
         let mut record_count = self.record_count;
         let mut min_ts = self.min_ts;
         let mut max_ts = self.max_ts;
-        if !self.pending.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */self.pending.is_empty() {
             let compressed = compress_frame(&self.pending, self.cfg.zstd_level)?;
             entries.push(FrameIndexEntry {
                 original_offset: original_off,
                 original_size: self.pending.len() as u64,
                 compressed_offset: body.len() as u64,
                 compressed_size: compressed.len() as u64,
             });
             ts_entries.push(TsEntry {

---- chunk::tests::empty_writer_finishes_to_none stdout ----

thread 'chunk::tests::empty_writer_finishes_to_none' (1968581) panicked at crates/s4logs-core/src/chunk.rs:244:9:
assertion failed: w.finish().unwrap().is_none()

---- chunk::tests::single_frame_roundtrips_via_plain_zstd stdout ----

thread 'chunk::tests::single_frame_roundtrips_via_plain_zstd' (1968584) panicked at crates/s4logs-core/src/chunk.rs:252:41:
called `Option::unwrap()` on a `None` value

---- chunk::tests::encode_does_not_consume_and_matches_finish stdout ----

thread 'chunk::tests::encode_does_not_consume_and_matches_finish' (1968582) panicked at crates/s4logs-core/src/chunk.rs:276:37:
called `Option::unwrap()` on a `None` value

failures:
    chunk::tests::empty_writer_finishes_to_none
    chunk::tests::encode_does_not_consume_and_matches_finish
    chunk::tests::single_frame_roundtrips_via_plain_zstd
    sink::tests::memory_sink_stores_data_and_stamped_sidecars
    store::tests::put_chunk_data_failure_skips_sidecars
    store::tests::put_chunk_sidecar_failure_surfaces
    store::tests::put_chunk_storage_class_applies_to_data_object_only
    store::tests::put_chunk_without_storage_class_sends_no_header_anywhere
    store::tests::put_chunk_writes_data_then_index_then_ts_index

test result: FAILED. 30 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
