*** crates/s4logs-core/src/chunk.rs:184:26: replace += with -= in ChunkWriter::encode

*** mutation diff:
--- crates/s4logs-core/src/chunk.rs
+++ replace += with -= in ChunkWriter::encode
@@ -176,17 +176,17 @@
                 original_size: self.pending.len() as u64,
                 compressed_offset: body.len() as u64,
                 compressed_size: compressed.len() as u64,
             });
             ts_entries.push(TsEntry {
                 min_ts: self.pending_min_ts,
                 max_ts: self.pending_max_ts,
             });
-            original_off += self.pending.len() as u64;
+            original_off -= /* ~ changed by cargo-mutants ~ */ self.pending.len() as u64;
             body.extend_from_slice(&compressed);
             record_count += self.pending_records;
             min_ts = min_ts.min(self.pending_min_ts);
             max_ts = max_ts.max(self.pending_max_ts);
         }
         if entries.is_empty() {
             return Ok(None);
         }

---- chunk::tests::encode_does_not_consume_and_matches_finish stdout ----

thread 'chunk::tests::encode_does_not_consume_and_matches_finish' (1970486) panicked at crates/s4logs-core/src/chunk.rs:184:13:
attempt to subtract with overflow

---- chunk::tests::single_frame_roundtrips_via_plain_zstd stdout ----

thread 'chunk::tests::single_frame_roundtrips_via_plain_zstd' (1970488) panicked at crates/s4logs-core/src/chunk.rs:184:13:
attempt to subtract with overflow

---- store::tests::put_chunk_writes_data_then_index_then_ts_index stdout ----

thread 'store::tests::put_chunk_writes_data_then_index_then_ts_index' (1970525) panicked at crates/s4logs-core/src/chunk.rs:184:13:
attempt to subtract with overflow

failures:
    chunk::tests::encode_does_not_consume_and_matches_finish
    chunk::tests::single_frame_roundtrips_via_plain_zstd
    read::tests::coalesce_merges_adjacent_frames
    sink::tests::memory_sink_stores_data_and_stamped_sidecars
    store::tests::put_chunk_data_failure_skips_sidecars
    store::tests::put_chunk_sidecar_failure_surfaces
    store::tests::put_chunk_storage_class_applies_to_data_object_only
    store::tests::put_chunk_without_storage_class_sends_no_header_anywhere
    store::tests::put_chunk_writes_data_then_index_then_ts_index

test result: FAILED. 30 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
