*** crates/s4logs-core/src/chunk.rs:186:26: replace += with *= in ChunkWriter::encode

*** mutation diff:
--- crates/s4logs-core/src/chunk.rs
+++ replace += with *= in ChunkWriter::encode
@@ -178,17 +178,17 @@
                 compressed_size: compressed.len() as u64,
             });
             ts_entries.push(TsEntry {
                 min_ts: self.pending_min_ts,
                 max_ts: self.pending_max_ts,
             });
             original_off += self.pending.len() as u64;
             body.extend_from_slice(&compressed);
-            record_count += self.pending_records;
+            record_count *= /* ~ changed by cargo-mutants ~ */ self.pending_records;
             min_ts = min_ts.min(self.pending_min_ts);
             max_ts = max_ts.max(self.pending_max_ts);
         }
         if entries.is_empty() {
             return Ok(None);
         }
         let body = Bytes::from(body);
         let crc = crc32c::crc32c(&body);

---- chunk::tests::encode_does_not_consume_and_matches_finish stdout ----

thread 'chunk::tests::encode_does_not_consume_and_matches_finish' (1979236) panicked at crates/s4logs-core/src/chunk.rs:279:9:
assertion `left == right` failed
  left: 0
 right: 2

---- chunk::tests::single_frame_roundtrips_via_plain_zstd stdout ----

thread 'chunk::tests::single_frame_roundtrips_via_plain_zstd' (1979238) panicked at crates/s4logs-core/src/chunk.rs:253:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    chunk::tests::encode_does_not_consume_and_matches_finish
    chunk::tests::single_frame_roundtrips_via_plain_zstd

test result: FAILED. 37 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
