*** crates/s4logs-core/src/chunk.rs:218:5: replace compress_frame -> std::io::Result<Vec<u8>> with Ok(vec![1])

*** mutation diff:
--- crates/s4logs-core/src/chunk.rs
+++ replace compress_frame -> std::io::Result<Vec<u8>> with Ok(vec![1])
@@ -210,22 +210,17 @@
             crc32c: crc,
             body,
         }))
     }
 }
 
 /// Compress one standalone standard zstd frame with content checksum.
 fn compress_frame(input: &[u8], level: i32) -> std::io::Result<Vec<u8>> {
-    let mut enc =
-        zstd::stream::write::Encoder::new(Vec::with_capacity(input.len() / 4 + 64), level)?;
-    enc.include_checksum(true)?;
-    enc.set_pledged_src_size(Some(input.len() as u64))?;
-    enc.write_all(input)?;
-    enc.finish()
+    Ok(vec![1]) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(clippy::unwrap_used)]
 mod tests {
     use super::*;
 
     fn rec(ts: i64, msg: &str) -> LogRecord {

---- chunk::tests::multi_frame_cut_and_concatenated_decode stdout ----

thread 'chunk::tests::multi_frame_cut_and_concatenated_decode' (1993156) panicked at crates/s4logs-core/src/chunk.rs:301:61:
called `Result::unwrap()` on an `Err` value: Custom { kind: Other, error: "Unknown frame descriptor" }

---- chunk::tests::single_frame_roundtrips_via_plain_zstd stdout ----

thread 'chunk::tests::single_frame_roundtrips_via_plain_zstd' (1993157) panicked at crates/s4logs-core/src/chunk.rs:254:61:
called `Result::unwrap()` on an `Err` value: Custom { kind: Other, error: "Unknown frame descriptor" }

---- read::tests::bomb_cap_stops_decoding_early stdout ----

thread 'read::tests::bomb_cap_stops_decoding_early' (1993169) panicked at crates/s4logs-core/src/read.rs:254:9:
got Io(Custom { kind: Other, error: "Unknown frame descriptor" })

failures:
    chunk::tests::multi_frame_cut_and_concatenated_decode
    chunk::tests::single_frame_roundtrips_via_plain_zstd
    read::tests::bomb_cap_stops_decoding_early
    read::tests::prune_then_decompress_selected_frames
    read::tests::undersized_claim_within_cap_rejected_as_size_mismatch

test result: FAILED. 34 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
