*** crates/s4logs-core/src/read.rs:125:25: replace != with == in decompress_frames

*** mutation diff:
--- crates/s4logs-core/src/read.rs
+++ replace != with == in decompress_frames
@@ -117,17 +117,17 @@
     let cap = expected_original.saturating_add(BOMB_SLACK_BYTES);
     let decoder = zstd::stream::read::Decoder::new(input)?;
     let mut limited = decoder.take(cap);
     let mut out = Vec::with_capacity((expected_original as usize).min(BOOTSTRAP_CAPACITY));
     limited.read_to_end(&mut out)?;
     if out.len() as u64 >= cap {
         return Err(ReadError::Bomb { cap });
     }
-    if out.len() as u64 != expected_original {
+    if out.len() as u64 == /* ~ changed by cargo-mutants ~ */ expected_original {
         return Err(ReadError::SizeMismatch {
             expected: expected_original,
             got: out.len() as u64,
         });
     }
     Ok(out)
 }

---- read::tests::undersized_claim_within_cap_rejected_as_size_mismatch stdout ----

thread 'read::tests::undersized_claim_within_cap_rejected_as_size_mismatch' (2084926) panicked at crates/s4logs-core/src/read.rs:234:65:

---- read::tests::prune_then_decompress_selected_frames stdout ----

thread 'read::tests::prune_then_decompress_selected_frames' (2084923) panicked at crates/s4logs-core/src/read.rs:207:68:
called `Result::unwrap()` on an `Err` value: SizeMismatch { expected: 210, got: 210 }

failures:
    read::tests::prune_then_decompress_selected_frames
    read::tests::undersized_claim_within_cap_rejected_as_size_mismatch

test result: FAILED. 37 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
