*** crates/s4logs-core/src/read.rs:158:71: replace == with != in <impl Iterator for RecordLines<'_>>::next

*** mutation diff:
--- crates/s4logs-core/src/read.rs
+++ replace == with != in <impl Iterator for RecordLines<'_>>::next
@@ -150,17 +150,17 @@
 impl Iterator for RecordLines<'_> {
     type Item = Result<LogRecord, RecordError>;
 
     fn next(&mut self) -> Option<Self::Item> {
         loop {
             if self.rest.is_empty() {
                 return None;
             }
-            let (line, rest) = match self.rest.iter().position(|&b| b == b'\n') {
+            let (line, rest) = match self.rest.iter().position(|&b| b != /* ~ changed by cargo-mutants ~ */ b'\n') {
                 Some(i) => (&self.rest[..i], &self.rest[i + 1..]),
                 None => (self.rest, &self.rest[..0]),
             };
             self.rest = rest;
             if !line.is_empty() {
                 return Some(LogRecord::from_jsonl(line));
             }
         }

---- read::tests::record_lines_streams_records_and_skips_blank_lines stdout ----

thread 'read::tests::record_lines_streams_records_and_skips_blank_lines' (2091580) panicked at crates/s4logs-core/src/read.rs:272:85:
called `Result::unwrap()` on an `Err` value: Decode(Error("EOF while parsing a value", line: 2, column: 0))

---- read::tests::record_lines_surfaces_parse_errors stdout ----

thread 'read::tests::record_lines_surfaces_parse_errors' (2091581) panicked at crates/s4logs-core/src/read.rs:287:9:
assertion failed: items[0].is_ok()

failures:
    read::tests::record_lines_streams_records_and_skips_blank_lines
    read::tests::record_lines_surfaces_parse_errors

test result: FAILED. 37 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
