*** crates/s4logs-core/src/read.rs:21:9: replace TimeRange::overlaps -> bool with true

*** mutation diff:
--- crates/s4logs-core/src/read.rs
+++ replace TimeRange::overlaps -> bool with true
@@ -13,17 +13,17 @@
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub struct TimeRange {
     pub from_ms: i64,
     pub to_ms_exclusive: i64,
 }
 
 impl TimeRange {
     pub fn overlaps(&self, min_ts: i64, max_ts: i64) -> bool {
-        min_ts < self.to_ms_exclusive && max_ts >= self.from_ms
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Debug, Error)]
 #[non_exhaustive]
 pub enum ReadError {
     #[error("S4IX has {frames} entries but S4LT has {ts_frames} — sidecars out of sync")]
     IndexMismatch { frames: usize, ts_frames: usize },

---- read::tests::prune_then_decompress_selected_frames stdout ----

thread 'read::tests::prune_then_decompress_selected_frames' (1991821) panicked at crates/s4logs-core/src/read.rs:204:9:
assertion failed: spans.len() < chunk.frame_index.entries.len()

failures:
    read::tests::prune_then_decompress_selected_frames

test result: FAILED. 38 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
