*** crates/s4logs-core/src/read.rs:99:44: replace << with >>

*** mutation diff:
--- crates/s4logs-core/src/read.rs
+++ replace << with >>
@@ -91,17 +91,17 @@
 
 /// How much slack the bomb cap allows over the sidecar-claimed size
 /// (mirrors s4 `cpu_zstd.rs`).
 pub const BOMB_SLACK_BYTES: u64 = 1024;
 const BOOTSTRAP_CAPACITY: usize = 1 << 20;
 /// Hard ceiling on a single object's decompressed size (64 GiB). A claimed
 /// `expected_original` above this is treated as a hostile sidecar — real log
 /// objects are bounded by the drain `--chunk-target` (default 256 MiB).
-pub const MAX_DECOMPRESSED_BYTES: u64 = 64 << 30;
+pub const MAX_DECOMPRESSED_BYTES: u64 = 64 >> /* ~ changed by cargo-mutants ~ */ 30;
 
 /// Decompress one or more concatenated standard zstd frames, refusing to
 /// emit more than `expected_original + BOMB_SLACK_BYTES` bytes.
 ///
 /// NOTE: when called on a *coalesced* span that includes skipped gap bytes,
 /// pass the summed `original_size` of the member frames — gap frames decode
 /// too (they are whole zstd frames), so prefer exact spans for grep and use
 /// coalescing only when the caller filters records afterwards anyway.

---- read::tests::undersized_claim_within_cap_rejected_as_size_mismatch stdout ----

thread 'read::tests::undersized_claim_within_cap_rejected_as_size_mismatch' (2061905) panicked at crates/s4logs-core/src/read.rs:235:9:
got Bomb { cap: 0 }

---- read::tests::prune_then_decompress_selected_frames stdout ----

thread 'read::tests::prune_then_decompress_selected_frames' (2061902) panicked at crates/s4logs-core/src/read.rs:207:68:
called `Result::unwrap()` on an `Err` value: Bomb { cap: 0 }

failures:
    read::tests::prune_then_decompress_selected_frames
    read::tests::undersized_claim_within_cap_rejected_as_size_mismatch

test result: FAILED. 37 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
