*** crates/s4logs-core/src/tsindex.rs:104:19: replace > with < in decode_ts_index

*** mutation diff:
--- crates/s4logs-core/src/tsindex.rs
+++ replace > with < in decode_ts_index
@@ -96,17 +96,17 @@
     }
     // Same bootstrap-capacity discipline as s4-codec `decode_index`: never
     // pre-allocate more than a sane bound off an attacker-supplied count.
     const BOOTSTRAP_ENTRIES: usize = 4096;
     let mut entries = Vec::with_capacity((n as usize).min(BOOTSTRAP_ENTRIES));
     for idx in 0..n {
         let min_ts = input.get_i64_le();
         let max_ts = input.get_i64_le();
-        if min_ts > max_ts {
+        if min_ts < /* ~ changed by cargo-mutants ~ */ max_ts {
             return Err(TsIndexError::InvalidEntry {
                 idx: idx as usize,
                 min_ts,
                 max_ts,
             });
         }
         entries.push(TsEntry { min_ts, max_ts });
     }

---- tsindex::tests::rejects_min_gt_max stdout ----

thread 'tsindex::tests::rejects_min_gt_max' (2221517) panicked at crates/s4logs-core/src/tsindex.rs:180:9:
assertion failed: matches!(decode_ts_index(buf.freeze()),
    Err(TsIndexError::InvalidEntry { .. }))

---- tsindex::tests::roundtrip stdout ----

thread 'tsindex::tests::roundtrip' (2221518) panicked at crates/s4logs-core/src/tsindex.rs:143:59:
called `Result::unwrap()` on an `Err` value: InvalidEntry { idx: 0, min_ts: 100, max_ts: 200 }

failures:
    tsindex::tests::rejects_min_gt_max
    tsindex::tests::roundtrip

test result: FAILED. 37 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
