*** crates/s4logs-core/src/tsindex.rs:104:19: replace > with >= in decode_ts_index

*** mutation diff:
--- crates/s4logs-core/src/tsindex.rs
+++ replace > with >= in decode_ts_index
@@ -96,17 +96,17 @@
     }
     // Same bootstrap-capacity discipline as s4-codec `decode_index`: never
     // pre-allocate more than a sane bound off an attacker-supplied count.
     const BOOTSTRAP_ENTRIES: usize = 4096;
     let mut entries = Vec::with_capacity((n as usize).min(BOOTSTRAP_ENTRIES));
     for idx in 0..n {
         let min_ts = input.get_i64_le();
         let max_ts = input.get_i64_le();
-        if min_ts > max_ts {
+        if min_ts >= /* ~ changed by cargo-mutants ~ */ max_ts {
             return Err(TsIndexError::InvalidEntry {
                 idx: idx as usize,
                 min_ts,
                 max_ts,
             });
         }
         entries.push(TsEntry { min_ts, max_ts });
     }

---- chunk_roundtrip stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'chunk_roundtrip' (2233816) panicked at crates/s4logs-core/tests/proptest_format.rs:77:44:
called `Result::unwrap()` on an `Err` value: InvalidEntry { idx: 0, min_ts: -6958408456652758876, max_ts: -6958408456652758876 }

thread 'chunk_roundtrip' (2233816) panicked at crates/s4logs-core/tests/proptest_format.rs:77:44:
called `Result::unwrap()` on an `Err` value: InvalidEntry { idx: 0, min_ts: 3967428031285676574, max_ts: 3967428031285676574 }

thread 'chunk_roundtrip' (2233816) panicked at crates/s4logs-core/tests/proptest_format.rs:77:44:
called `Result::unwrap()` on an `Err` value: InvalidEntry { idx: 0, min_ts: 5460478008558165550, max_ts: 5460478008558165550 }

thread 'chunk_roundtrip' (2233816) panicked at crates/s4logs-core/tests/proptest_format.rs:77:4

failures:
    chunk_roundtrip

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
