*** crates/s4logs-core/src/tsindex.rs:19:38: replace + with *

*** mutation diff:
--- crates/s4logs-core/src/tsindex.rs
+++ replace + with *
@@ -11,17 +11,17 @@
 //! S4IX itself is reused verbatim from s4-codec; S4LT deliberately lives in
 //! a separate file so the S4IX format stays byte-identical to S4 proper.
 
 use bytes::{Buf, BufMut, Bytes, BytesMut};
 use thiserror::Error;
 
 pub const TS_INDEX_MAGIC: &[u8; 4] = b"S4LT";
 pub const TS_INDEX_VERSION: u32 = 1;
-pub const TS_HEADER_BYTES: usize = 4 + 4 + 8;
+pub const TS_HEADER_BYTES: usize = 4 * /* ~ changed by cargo-mutants ~ */ 4 + 8;
 pub const TS_ENTRY_BYTES: usize = 8 + 8;
 /// Same hard cap as `s4_codec::index::MAX_FRAMES` — the two sidecars are
 /// 1:1, so a count that S4IX would refuse is equally hostile here.
 pub const MAX_FRAMES: u64 = 16 * 1024 * 1024;
 
 /// Timestamp range (epoch ms, inclusive both ends) of one zstd frame.
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub struct TsEntry {

---- tsindex::tests::empty_roundtrip stdout ----

thread 'tsindex::tests::empty_roundtrip' (2117256) panicked at crates/s4logs-core/src/tsindex.rs:149:59:
called `Result::unwrap()` on an `Err` value: TooShort(16)

---- tsindex::tests::rejects_huge_count_before_alloc stdout ----

thread 'tsindex::tests::rejects_huge_count_before_alloc' (2117262) panicked at crates/s4logs-core/src/tsindex.rs:192:9:
assertion failed: matches!(decode_ts_index(buf.freeze()),
    Err(TsIndexError::TooManyFrames { .. }))

failures:
    tsindex::tests::empty_roundtrip
    tsindex::tests::rejects_huge_count_before_alloc

test result: FAILED. 37 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
