*** crates/s4logs-core/src/tsindex.rs:23:32: replace * with +

*** mutation diff:
--- crates/s4logs-core/src/tsindex.rs
+++ replace * with +
@@ -15,17 +15,17 @@
 use thiserror::Error;
 
 pub const TS_INDEX_MAGIC: &[u8; 4] = b"S4LT";
 pub const TS_INDEX_VERSION: u32 = 1;
 pub const TS_HEADER_BYTES: usize = 4 + 4 + 8;
 pub const TS_ENTRY_BYTES: usize = 8 + 8;
 /// Same hard cap as `s4_codec::index::MAX_FRAMES` — the two sidecars are
 /// 1:1, so a count that S4IX would refuse is equally hostile here.
-pub const MAX_FRAMES: u64 = 16 * 1024 * 1024;
+pub const MAX_FRAMES: u64 = 16 + /* ~ changed by cargo-mutants ~ */ 1024 * 1024;
 
 /// Timestamp range (epoch ms, inclusive both ends) of one zstd frame.
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub struct TsEntry {
     pub min_ts: i64,
     pub max_ts: i64,
 }

*** result: Success
