*** crates/s4logs-core/src/tsindex.rs:23:32: replace * with /

*** mutation diff:
--- crates/s4logs-core/src/tsindex.rs
+++ replace * with /
@@ -15,17 +15,17 @@
 use thiserror::Error;
 
 pub const TS_INDEX_MAGIC: &[u8; 4] = b"S4LT";
 pub const TS_INDEX_VERSION: u32 = 1;
 pub const TS_HEADER_BYTES: usize = 4 + 4 + 8;
 pub const TS_ENTRY_BYTES: usize = 8 + 8;
 /// Same hard cap as `s4_codec::index::MAX_FRAMES` — the two sidecars are
 /// 1:1, so a count that S4IX would refuse is equally hostile here.
-pub const MAX_FRAMES: u64 = 16 * 1024 * 1024;
+pub const MAX_FRAMES: u64 = 16 / /* ~ changed by cargo-mutants ~ */ 1024 * 1024;
 
 /// Timestamp range (epoch ms, inclusive both ends) of one zstd frame.
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub struct TsEntry {
     pub min_ts: i64,
     pub max_ts: i64,
 }

---- tsindex::tests::rejects_count_mismatch stdout ----

thread 'tsindex::tests::rejects_count_mismatch' (2156139) panicked at crates/s4logs-core/src/tsindex.rs:166:9:
assertion failed: matches!(decode_ts_index(Bytes::from(bytes)),
    Err(TsIndexError::EntryCountMismatch { .. }))

---- tsindex::tests::roundtrip stdout ----

thread 'tsindex::tests::roundtrip' (2156144) panicked at crates/s4logs-core/src/tsindex.rs:143:59:
called `Result::unwrap()` on an `Err` value: TooManyFrames { got: 3 }

---- tsindex::tests::rejects_min_gt_max stdout ----

thread 'tsindex::tests::rejects_min_gt_max' (2156143) panicked at crates/s4logs-core/src/tsindex.rs:180:9:
assertion failed: matches!(decode_ts_index(buf.freeze()),
    Err(TsIndexError::InvalidEntry { .. }))

failures:
    tsindex::tests::rejects_count_mismatch
    tsindex::tests::rejects_min_gt_max
    tsindex::tests::roundtrip

test result: FAILED. 36 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
