*** crates/s4logs-core/src/tsindex.rs:23:39: replace * with /

*** mutation diff:
--- crates/s4logs-core/src/tsindex.rs
+++ replace * with /
@@ -15,17 +15,17 @@
 use thiserror::Error;
 
 pub const TS_INDEX_MAGIC: &[u8; 4] = b"S4LT";
 pub const TS_INDEX_VERSION: u32 = 1;
 pub const TS_HEADER_BYTES: usize = 4 + 4 + 8;
 pub const TS_ENTRY_BYTES: usize = 8 + 8;
 /// Same hard cap as `s4_codec::index::MAX_FRAMES` — the two sidecars are
 /// 1:1, so a count that S4IX would refuse is equally hostile here.
-pub const MAX_FRAMES: u64 = 16 * 1024 * 1024;
+pub const MAX_FRAMES: u64 = 16 * 1024 / /* ~ changed by cargo-mutants ~ */ 1024;
 
 /// Timestamp range (epoch ms, inclusive both ends) of one zstd frame.
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 pub struct TsEntry {
     pub min_ts: i64,
     pub max_ts: i64,
 }

---- tsindex_roundtrip stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'tsindex_roundtrip' (2145355) panicked at crates/s4logs-core/tests/proptest_format.rs:141:64:
called `Result::unwrap()` on an `Err` value: TooManyFrames { got: 57 }

thread 'tsindex_roundtrip' (2145355) panicked at crates/s4logs-core/tests/proptest_format.rs:141:64:
called `Result::unwrap()` on an `Err` value: TooManyFrames { got: 56 }

thread 'tsindex_roundtrip' (2145355) panicked at crates/s4logs-core/tests/proptest_format.rs:141:64:
called `Result::unwrap()` on an `Err` value: TooManyFrames { got: 55 }

thread 'tsindex_roundtrip' (2145355) panicked at crates/s4logs-core/tests/proptest_format.rs:141:64:
called `Result::unwrap()` on an `Err` value: TooManyFrames { got: 54 }

---- chunk_roundtrip stdout ----
proptest: FileFailurePersistence::SourceParallel set, but failed to find lib.rs or main.rs

thread 'chunk_roundtrip' (2145352) panicked at crates/s4logs-core/tests/proptest_format.rs:77:44:
called `Result::unwrap()` on an `Err` value: TooManyFrames { got: 23 }

thread 'chunk_roundtrip' (2145352) panicked at crates/s4logs-core/tests/proptest_format.rs:77:44:
called `Result::unwrap()` on an `Err` value: TooManyFrames { got: 22 }

thread 'chunk_roundtrip' (2145352) panicked at crates/s4logs-core/tests/proptest_format.rs:77:44:
called `Result::unwrap()` on an `Err` value: TooManyFrames { got: 21 }

thread 'chunk_roundtrip' (2145352) panicked at crates/s4logs-core/tests/proptest_format.rs:77:44:
called `Result::unwrap()` on an `Err` value: TooManyFrames { got: 20 }

failures:
    chunk_roundtrip
    tsindex_roundtrip

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.88s

*** result: Failure(101)
