*** crates/s4logs-core/src/tsindex.rs:61:5: replace encode_ts_index -> Bytes with Default::default()

*** mutation diff:
--- crates/s4logs-core/src/tsindex.rs
+++ replace encode_ts_index -> Bytes with Default::default()
@@ -53,25 +53,17 @@
     InvalidEntry {
         idx: usize,
         min_ts: i64,
         max_ts: i64,
     },
 }
 
 pub fn encode_ts_index(idx: &TsIndex) -> Bytes {
-    let mut buf = BytesMut::with_capacity(TS_HEADER_BYTES + idx.entries.len() * TS_ENTRY_BYTES);
-    buf.put_slice(TS_INDEX_MAGIC);
-    buf.put_u32_le(TS_INDEX_VERSION);
-    buf.put_u64_le(idx.entries.len() as u64);
-    for e in &idx.entries {
-        buf.put_i64_le(e.min_ts);
-        buf.put_i64_le(e.max_ts);
-    }
-    buf.freeze()
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn decode_ts_index(mut input: Bytes) -> Result<TsIndex, TsIndexError> {
     if input.len() < TS_HEADER_BYTES {
         return Err(TsIndexError::TooShort(input.len()));
     }
     let mut magic = [0u8; 4];
     magic.copy_from_slice(&input[..4]);

---- tsindex::tests::roundtrip stdout ----

thread 'tsindex::tests::roundtrip' (2167136) panicked at crates/s4logs-core/src/tsindex.rs:135:59:
called `Result::unwrap()` on an `Err` value: TooShort(0)

---- tsindex::tests::rejects_bad_magic stdout ----

thread 'tsindex::tests::rejects_bad_magic' (2167132) panicked at crates/s4logs-core/src/tsindex.rs:147:14:
index out of bounds: the len is 0 but the index is 0

---- tsindex::tests::rejects_count_mismatch stdout ----

thread 'tsindex::tests::rejects_count_mismatch' (2167133) panicked at crates/s4logs-core/src/tsindex.rs:157:24:
attempt to subtract with overflow

failures:
    tsindex::tests::empty_roundtrip
    tsindex::tests::rejects_bad_magic
    tsindex::tests::rejects_count_mismatch
    tsindex::tests::roundtrip

test result: FAILED. 35 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
