*** crates/s4logs-core/src/tsindex.rs:73:20: replace < with == in decode_ts_index

*** mutation diff:
--- crates/s4logs-core/src/tsindex.rs
+++ replace < with == in decode_ts_index
@@ -65,17 +65,17 @@
     for e in &idx.entries {
         buf.put_i64_le(e.min_ts);
         buf.put_i64_le(e.max_ts);
     }
     buf.freeze()
 }
 
 pub fn decode_ts_index(mut input: Bytes) -> Result<TsIndex, TsIndexError> {
-    if input.len() < TS_HEADER_BYTES {
+    if input.len() == /* ~ changed by cargo-mutants ~ */ TS_HEADER_BYTES {
         return Err(TsIndexError::TooShort(input.len()));
     }
     let mut magic = [0u8; 4];
     magic.copy_from_slice(&input[..4]);
     if &magic != TS_INDEX_MAGIC {
         return Err(TsIndexError::BadMagic { got: magic });
     }
     input.advance(4);

---- tsindex::tests::empty_roundtrip stdout ----

thread 'tsindex::tests::empty_roundtrip' (2174962) panicked at crates/s4logs-core/src/tsindex.rs:149:59:
called `Result::unwrap()` on an `Err` value: TooShort(16)

---- tsindex::tests::rejects_huge_count_before_alloc stdout ----

thread 'tsindex::tests::rejects_huge_count_before_alloc' (2174965) panicked at crates/s4logs-core/src/tsindex.rs:192:9:
assertion failed: matches!(decode_ts_index(buf.freeze()),
    Err(TsIndexError::TooManyFrames { .. }))

failures:
    tsindex::tests::empty_roundtrip
    tsindex::tests::rejects_huge_count_before_alloc

test result: FAILED. 37 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
