*** crates/s4logs-core/src/tsindex.rs:73:20: replace < with > in decode_ts_index

*** mutation diff:
--- crates/s4logs-core/src/tsindex.rs
+++ replace < with > in decode_ts_index
@@ -65,17 +65,17 @@
     for e in &idx.entries {
         buf.put_i64_le(e.min_ts);
         buf.put_i64_le(e.max_ts);
     }
     buf.freeze()
 }
 
 pub fn decode_ts_index(mut input: Bytes) -> Result<TsIndex, TsIndexError> {
-    if input.len() < TS_HEADER_BYTES {
+    if input.len() > /* ~ changed by cargo-mutants ~ */ TS_HEADER_BYTES {
         return Err(TsIndexError::TooShort(input.len()));
     }
     let mut magic = [0u8; 4];
     magic.copy_from_slice(&input[..4]);
     if &magic != TS_INDEX_MAGIC {
         return Err(TsIndexError::BadMagic { got: magic });
     }
     input.advance(4);

---- tsindex::tests::rejects_count_mismatch stdout ----

thread 'tsindex::tests::rejects_count_mismatch' (2177491) panicked at crates/s4logs-core/src/tsindex.rs:166:9:
assertion failed: matches!(decode_ts_index(Bytes::from(bytes)),
    Err(TsIndexError::EntryCountMismatch { .. }))

---- tsindex::tests::roundtrip stdout ----

thread 'tsindex::tests::roundtrip' (2177495) panicked at crates/s4logs-core/src/tsindex.rs:143:59:
called `Result::unwrap()` on an `Err` value: TooShort(64)

---- tsindex::tests::rejects_min_gt_max stdout ----

thread 'tsindex::tests::rejects_min_gt_max' (2177494) panicked at crates/s4logs-core/src/tsindex.rs:180:9:
assertion failed: matches!(decode_ts_index(buf.freeze()),
    Err(TsIndexError::InvalidEntry { .. }))

failures:
    tsindex::tests::rejects_bad_magic
    tsindex::tests::rejects_count_mismatch
    tsindex::tests::rejects_min_gt_max
    tsindex::tests::roundtrip

test result: FAILED. 35 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
