*** crates/s4logs-core/src/tsindex.rs:73:5: replace decode_ts_index -> Result<TsIndex, TsIndexError> with Ok(Default::default())

*** mutation diff:
--- crates/s4logs-core/src/tsindex.rs
+++ replace decode_ts_index -> Result<TsIndex, TsIndexError> with Ok(Default::default())
@@ -65,57 +65,17 @@
     for e in &idx.entries {
         buf.put_i64_le(e.min_ts);
         buf.put_i64_le(e.max_ts);
     }
     buf.freeze()
 }
 
 pub fn decode_ts_index(mut input: Bytes) -> Result<TsIndex, TsIndexError> {
-    if input.len() < TS_HEADER_BYTES {
-        return Err(TsIndexError::TooShort(input.len()));
-    }
-    let mut magic = [0u8; 4];
-    magic.copy_from_slice(&input[..4]);
-    if &magic != TS_INDEX_MAGIC {
-        return Err(TsIndexError::BadMagic { got: magic });
-    }
-    input.advance(4);
-    let version = input.get_u32_le();
-    if version != TS_INDEX_VERSION {
-        return Err(TsIndexError::UnsupportedVersion(version));
-    }
-    let n = input.get_u64_le();
-    if n > MAX_FRAMES {
-        return Err(TsIndexError::TooManyFrames { got: n });
-    }
-    let expected_remaining = (n as usize).saturating_mul(TS_ENTRY_BYTES);
-    if input.len() != expected_remaining {
-        return Err(TsIndexError::EntryCountMismatch {
-            claimed: n,
-            remaining: input.len(),
-        });
-    }
-    // Same bootstrap-capacity discipline as s4-codec `decode_index`: never
-    // pre-allocate more than a sane bound off an attacker-supplied count.
-    const BOOTSTRAP_ENTRIES: usize = 4096;
-    let mut entries = Vec::with_capacity((n as usize).min(BOOTSTRAP_ENTRIES));
-    for idx in 0..n {
-        let min_ts = input.get_i64_le();
-        let max_ts = input.get_i64_le();
-        if min_ts > max_ts {
-            return Err(TsIndexError::InvalidEntry {
-                idx: idx as usize,
-                min_ts,
-                max_ts,
-            });
-        }
-        entries.push(TsEntry { min_ts, max_ts });
-    }
-    Ok(TsIndex { entries })
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 #[allow(clippy::unwrap_used)]
 mod tests {
     use super::*;
 
     fn sample() -> TsIndex {

---- tsindex::tests::rejects_bad_magic stdout ----

thread 'tsindex::tests::rejects_bad_magic' (2168847) panicked at crates/s4logs-core/src/tsindex.rs:116:9:
assertion failed: matches!(decode_ts_index(Bytes::from(bytes)),
    Err(TsIndexError::BadMagic { .. }))

---- tsindex::tests::rejects_count_mismatch stdout ----

thread 'tsindex::tests::rejects_count_mismatch' (2168848) panicked at crates/s4logs-core/src/tsindex.rs:126:9:
assertion failed: matches!(decode_ts_index(Bytes::from(bytes)),
    Err(TsIndexError::EntryCountMismatch { .. }))

---- tsindex::tests::rejects_huge_count_before_alloc stdout ----

thread 'tsindex::tests::rejects_huge_count_before_alloc' (2168850) panicked at crates/s4logs-core/src/tsindex.rs:152:9:
assertion failed: matches!(decode_ts_index(buf.freeze()),
    Err(TsIndexError::TooManyFrames { .. }))

failures:
    tsindex::tests::rejects_bad_magic
    tsindex::tests::rejects_count_mismatch
    tsindex::tests::rejects_huge_count_before_alloc
    tsindex::tests::rejects_min_gt_max
    tsindex::tests::roundtrip

test result: FAILED. 34 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
