*** crates/s4logs-core/src/tsindex.rs:78:15: replace != with == in decode_ts_index

*** mutation diff:
--- crates/s4logs-core/src/tsindex.rs
+++ replace != with == in decode_ts_index
@@ -70,17 +70,17 @@
 }
 
 pub fn decode_ts_index(mut input: Bytes) -> Result<TsIndex, TsIndexError> {
     if input.len() < TS_HEADER_BYTES {
         return Err(TsIndexError::TooShort(input.len()));
     }
     let mut magic = [0u8; 4];
     magic.copy_from_slice(&input[..4]);
-    if &magic != TS_INDEX_MAGIC {
+    if &magic == /* ~ changed by cargo-mutants ~ */ TS_INDEX_MAGIC {
         return Err(TsIndexError::BadMagic { got: magic });
     }
     input.advance(4);
     let version = input.get_u32_le();
     if version != TS_INDEX_VERSION {
         return Err(TsIndexError::UnsupportedVersion(version));
     }
     let n = input.get_u64_le();

---- tsindex::tests::empty_roundtrip stdout ----

thread 'tsindex::tests::empty_roundtrip' (2186881) panicked at crates/s4logs-core/src/tsindex.rs:149:59:
called `Result::unwrap()` on an `Err` value: BadMagic { got: [83, 52, 76, 84] }

---- tsindex::tests::rejects_bad_magic stdout ----

thread 'tsindex::tests::rejects_bad_magic' (2186882) panicked at crates/s4logs-core/src/tsindex.rs:156:9:
assertion failed: matches!(decode_ts_index(Bytes::from(bytes)),
    Err(TsIndexError::BadMagic { .. }))

---- tsindex::tests::rejects_count_mismatch stdout ----

thread 'tsindex::tests::rejects_count_mismatch' (2186884) panicked at crates/s4logs-core/src/tsindex.rs:166:9:
assertion failed: matches!(decode_ts_index(Bytes::from(bytes)),
    Err(TsIndexError::EntryCountMismatch { .. }))

failures:
    tsindex::tests::empty_roundtrip
    tsindex::tests::rejects_bad_magic
    tsindex::tests::rejects_count_mismatch
    tsindex::tests::rejects_huge_count_before_alloc
    tsindex::tests::rejects_min_gt_max
    tsindex::tests::roundtrip

test result: FAILED. 33 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
