*** crates/s4logs-core/src/tsindex.rs:83:16: replace != with == in decode_ts_index

*** mutation diff:
--- crates/s4logs-core/src/tsindex.rs
+++ replace != with == in decode_ts_index
@@ -75,17 +75,17 @@
     }
     let mut magic = [0u8; 4];
     magic.copy_from_slice(&input[..4]);
     if &magic != TS_INDEX_MAGIC {
         return Err(TsIndexError::BadMagic { got: magic });
     }
     input.advance(4);
     let version = input.get_u32_le();
-    if version != TS_INDEX_VERSION {
+    if version == /* ~ changed by cargo-mutants ~ */ TS_INDEX_VERSION {
         return Err(TsIndexError::UnsupportedVersion(version));
     }
     let n = input.get_u64_le();
     if n > MAX_FRAMES {
         return Err(TsIndexError::TooManyFrames { got: n });
     }
     let expected_remaining = (n as usize).saturating_mul(TS_ENTRY_BYTES);
     if input.len() != expected_remaining {

---- tsindex::tests::rejects_count_mismatch stdout ----

thread 'tsindex::tests::rejects_count_mismatch' (2192297) panicked at crates/s4logs-core/src/tsindex.rs:166:9:
assertion failed: matches!(decode_ts_index(Bytes::from(bytes)),
    Err(TsIndexError::EntryCountMismatch { .. }))

---- tsindex::tests::rejects_huge_count_before_alloc stdout ----

thread 'tsindex::tests::rejects_huge_count_before_alloc' (2192298) panicked at crates/s4logs-core/src/tsindex.rs:192:9:
assertion failed: matches!(decode_ts_index(buf.freeze()),
    Err(TsIndexError::TooManyFrames { .. }))

---- tsindex::tests::rejects_min_gt_max stdout ----

thread 'tsindex::tests::rejects_min_gt_max' (2192299) panicked at crates/s4logs-core/src/tsindex.rs:180:9:
assertion failed: matches!(decode_ts_index(buf.freeze()),
    Err(TsIndexError::InvalidEntry { .. }))

failures:
    tsindex::tests::empty_roundtrip
    tsindex::tests::rejects_count_mismatch
    tsindex::tests::rejects_huge_count_before_alloc
    tsindex::tests::rejects_min_gt_max
    tsindex::tests::roundtrip

test result: FAILED. 34 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
