*** crates/s4logs-core/src/tsindex.rs:87:10: replace > with == in decode_ts_index

*** mutation diff:
--- crates/s4logs-core/src/tsindex.rs
+++ replace > with == in decode_ts_index
@@ -79,17 +79,17 @@
         return Err(TsIndexError::BadMagic { got: magic });
     }
     input.advance(4);
     let version = input.get_u32_le();
     if version != TS_INDEX_VERSION {
         return Err(TsIndexError::UnsupportedVersion(version));
     }
     let n = input.get_u64_le();
-    if n > MAX_FRAMES {
+    if n == /* ~ changed by cargo-mutants ~ */ MAX_FRAMES {
         return Err(TsIndexError::TooManyFrames { got: n });
     }
     let expected_remaining = (n as usize).saturating_mul(TS_ENTRY_BYTES);
     if input.len() != expected_remaining {
         return Err(TsIndexError::EntryCountMismatch {
             claimed: n,
             remaining: input.len(),
         });

---- tsindex::tests::rejects_huge_count_before_alloc stdout ----

thread 'tsindex::tests::rejects_huge_count_before_alloc' (2195204) panicked at crates/s4logs-core/src/tsindex.rs:192:9:
assertion failed: matches!(decode_ts_index(buf.freeze()),
    Err(TsIndexError::TooManyFrames { .. }))

failures:
    tsindex::tests::rejects_huge_count_before_alloc

test result: FAILED. 38 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
