*** crates/s4logs-core/src/tsindex.rs:87:10: replace > with < in decode_ts_index

*** mutation diff:
--- crates/s4logs-core/src/tsindex.rs
+++ replace > with < in decode_ts_index
@@ -79,17 +79,17 @@
         return Err(TsIndexError::BadMagic { got: magic });
     }
     input.advance(4);
     let version = input.get_u32_le();
     if version != TS_INDEX_VERSION {
         return Err(TsIndexError::UnsupportedVersion(version));
     }
     let n = input.get_u64_le();
-    if n > MAX_FRAMES {
+    if n < /* ~ changed by cargo-mutants ~ */ MAX_FRAMES {
         return Err(TsIndexError::TooManyFrames { got: n });
     }
     let expected_remaining = (n as usize).saturating_mul(TS_ENTRY_BYTES);
     if input.len() != expected_remaining {
         return Err(TsIndexError::EntryCountMismatch {
             claimed: n,
             remaining: input.len(),
         });

---- tsindex::tests::rejects_min_gt_max stdout ----

thread 'tsindex::tests::rejects_min_gt_max' (2201482) panicked at crates/s4logs-core/src/tsindex.rs:180:9:
assertion failed: matches!(decode_ts_index(buf.freeze()),
    Err(TsIndexError::InvalidEntry { .. }))

---- tsindex::tests::rejects_huge_count_before_alloc stdout ----

thread 'tsindex::tests::rejects_huge_count_before_alloc' (2201481) panicked at crates/s4logs-core/src/tsindex.rs:192:9:
assertion failed: matches!(decode_ts_index(buf.freeze()),
    Err(TsIndexError::TooManyFrames { .. }))

---- tsindex::tests::empty_roundtrip stdout ----

thread 'tsindex::tests::empty_roundtrip' (2201478) panicked at crates/s4logs-core/src/tsindex.rs:149:59:
called `Result::unwrap()` on an `Err` value: TooManyFrames { got: 0 }

failures:
    tsindex::tests::empty_roundtrip
    tsindex::tests::rejects_count_mismatch
    tsindex::tests::rejects_huge_count_before_alloc
    tsindex::tests::rejects_min_gt_max
    tsindex::tests::roundtrip

test result: FAILED. 34 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
