*** crates/s4logs-core/src/tsindex.rs:91:20: replace != with == in decode_ts_index

*** mutation diff:
--- crates/s4logs-core/src/tsindex.rs
+++ replace != with == in decode_ts_index
@@ -83,17 +83,17 @@
     if version != TS_INDEX_VERSION {
         return Err(TsIndexError::UnsupportedVersion(version));
     }
     let n = input.get_u64_le();
     if n > MAX_FRAMES {
         return Err(TsIndexError::TooManyFrames { got: n });
     }
     let expected_remaining = (n as usize).saturating_mul(TS_ENTRY_BYTES);
-    if input.len() != expected_remaining {
+    if input.len() == /* ~ changed by cargo-mutants ~ */ expected_remaining {
         return Err(TsIndexError::EntryCountMismatch {
             claimed: n,
             remaining: input.len(),
         });
     }
     // Same bootstrap-capacity discipline as s4-codec `decode_index`: never
     // pre-allocate more than a sane bound off an attacker-supplied count.
     const BOOTSTRAP_ENTRIES: usize = 4096;

---- tsindex::tests::empty_roundtrip stdout ----

thread 'tsindex::tests::empty_roundtrip' (2211054) panicked at crates/s4logs-core/src/tsindex.rs:149:59:
called `Result::unwrap()` on an `Err` value: EntryCountMismatch { claimed: 0, remaining: 0 }

---- tsindex::tests::rejects_min_gt_max stdout ----

thread 'tsindex::tests::rejects_min_gt_max' (2211058) panicked at crates/s4logs-core/src/tsindex.rs:180:9:
assertion failed: matches!(decode_ts_index(buf.freeze()),
    Err(TsIndexError::InvalidEntry { .. }))

---- tsindex::tests::roundtrip stdout ----

thread 'tsindex::tests::roundtrip' (2211059) panicked at crates/s4logs-core/src/tsindex.rs:143:59:
called `Result::unwrap()` on an `Err` value: EntryCountMismatch { claimed: 3, remaining: 48 }

failures:
    tsindex::tests::empty_roundtrip
    tsindex::tests::rejects_count_mismatch
    tsindex::tests::rejects_min_gt_max
    tsindex::tests::roundtrip

test result: FAILED. 35 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
