*** crates/s4logs-drain/src/manifest.rs:113:9: replace Manifest::to_json_bytes -> Result<Bytes, ManifestError> with Ok(Default::default())

*** mutation diff:
--- crates/s4logs-drain/src/manifest.rs
+++ replace Manifest::to_json_bytes -> Result<Bytes, ManifestError> with Ok(Default::default())
@@ -105,19 +105,17 @@
     #[error("manifest decode failed")]
     Decode(#[source] serde_json::Error),
     #[error("unsupported manifest version {0} (this build supports {MANIFEST_VERSION})")]
     UnsupportedVersion(u32),
 }
 
 impl Manifest {
     pub fn to_json_bytes(&self) -> Result<Bytes, ManifestError> {
-        serde_json::to_vec(self)
-            .map(Bytes::from)
-            .map_err(ManifestError::Encode)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Decode + version check.
     pub fn from_json_bytes(bytes: &[u8]) -> Result<Self, ManifestError> {
         let m: Manifest = serde_json::from_slice(bytes).map_err(ManifestError::Decode)?;
         if m.version != MANIFEST_VERSION {
             return Err(ManifestError::UnsupportedVersion(m.version));
         }

---- job::tests::idempotent_skip_when_manifest_exists stdout ----

thread 'job::tests::idempotent_skip_when_manifest_exists' (2454434) panicked at crates/s4logs-drain/src/job.rs:766:9:
assertion `left == right` failed
  left: 0
 right: 1

---- job::tests::skip_does_not_touch_cw stdout ----

thread 'job::tests::skip_does_not_touch_cw' (2454450) panicked at crates/s4logs-drain/src/job.rs:785:9:
assertion `left == right` failed
  left: 1
 right: 0

---- job::tests::pagination_rotation_and_manifest stdout ----

thread 'job::tests::pagination_rotation_and_manifest' (2454443) panicked at crates/s4logs-drain/src/job.rs:725:90:
called `Result::unwrap()` on an `Err` value: Decode(Error("EOF while parsing a value", line: 1, column: 0))

failures:
    job::tests::empty_window_writes_manifest_with_no_objects
    job::tests::idempotent_skip_when_manifest_exists
    job::tests::out_of_window_events_are_dropped_not_archived
    job::tests::pagination_rotation_and_manifest
    job::tests::progress_reports_skipped_windows
    job::tests::sharded_drain_archives_the_same_record_set_as_unsharded
    job::tests::skip_does_not_touch_cw
    manifest::tests::empty_window_manifest_roundtrip
    manifest::tests::manifest_json_golden
    manifest::tests::manifest_roundtrip
    manifest::tests::manifest_with_reconcile_fields_golden_and_roundtrip
    manifest::tests::manifest_with_storage_class_golden_and_roundtrip

test result: FAILED. 48 passed; 26 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
