*** crates/s4logs-drain/src/manifest.rs:121:22: replace != with == in Manifest::from_json_bytes

*** mutation diff:
--- crates/s4logs-drain/src/manifest.rs
+++ replace != with == in Manifest::from_json_bytes
@@ -113,17 +113,17 @@
         serde_json::to_vec(self)
             .map(Bytes::from)
             .map_err(ManifestError::Encode)
     }
 
     /// Decode + version check.
     pub fn from_json_bytes(bytes: &[u8]) -> Result<Self, ManifestError> {
         let m: Manifest = serde_json::from_slice(bytes).map_err(ManifestError::Decode)?;
-        if m.version != MANIFEST_VERSION {
+        if m.version == /* ~ changed by cargo-mutants ~ */ MANIFEST_VERSION {
             return Err(ManifestError::UnsupportedVersion(m.version));
         }
         Ok(m)
     }
 }
 
 /// True only if `bytes` decodes into a complete, version-checked manifest
 /// that belongs to exactly this account / log group / window. Any decode

---- manifest::tests::manifest_without_raw_bytes_still_decodes stdout ----

thread 'manifest::tests::manifest_without_raw_bytes_still_decodes' (2475818) panicked at crates/s4logs-drain/src/manifest.rs:369:62:
called `Result::unwrap()` on an `Err` value: UnsupportedVersion(1)

---- manifest::tests::empty_window_manifest_roundtrip stdout ----

thread 'manifest::tests::empty_window_manifest_roundtrip' (2475813) panicked at crates/s4logs-drain/src/manifest.rs:435:75:
called `Result::unwrap()` on an `Err` value: UnsupportedVersion(1)

---- job::tests::skip_does_not_touch_cw stdout ----

thread 'job::tests::skip_does_not_touch_cw' (2475811) panicked at crates/s4logs-drain/src/job.rs:785:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    job::tests::empty_window_writes_manifest_with_no_objects
    job::tests::idempotent_skip_when_manifest_exists
    job::tests::out_of_window_events_are_dropped_not_archived
    job::tests::pagination_rotation_and_manifest
    job::tests::progress_reports_skipped_windows
    job::tests::sharded_drain_archives_the_same_record_set_as_unsharded
    job::tests::skip_does_not_touch_cw
    manifest::tests::empty_window_manifest_roundtrip
    manifest::tests::manifest_roundtrip
    manifest::tests::manifest_with_reconcile_fields_golden_and_roundtrip
    manifest::tests::manifest_with_storage_class_golden_and_roundtrip
    manifest::tests::manifest_without_raw_bytes_still_decodes

test result: FAILED. 48 passed; 26 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
