*** crates/s4logs-drain/src/manifest.rs:140:5: replace manifest_covers_window -> bool with false

*** mutation diff:
--- crates/s4logs-drain/src/manifest.rs
+++ replace manifest_covers_window -> bool with false
@@ -132,25 +132,17 @@
 /// object is never mistaken for proof of coverage (fail-closed).
 pub fn manifest_covers_window(
     bytes: &[u8],
     account: &str,
     log_group: &str,
     window_start_ms: i64,
     window_end_ms: i64,
 ) -> bool {
-    match Manifest::from_json_bytes(bytes) {
-        Ok(m) => {
-            m.account == account
-                && m.log_group == log_group
-                && m.window_start_ms == window_start_ms
-                && m.window_end_ms == window_end_ms
-        }
-        Err(_) => false,
-    }
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Parse the window out of a manifest key
 /// (`…/window={start_ms}-{end_ms}.json`). Returns `None` for foreign keys.
 /// Window timestamps are non-negative by construction ([`crate::window`]).
 pub fn parse_manifest_key_window(key: &str) -> Option<Window> {
     let base = key.rsplit('/').next()?;
     let inner = base.strip_prefix("window=")?.strip_suffix(".json")?;

---- job::tests::progress_reports_skipped_windows stdout ----

thread 'job::tests::progress_reports_skipped_windows' (2479950) panicked at crates/s4logs-drain/src/job.rs:1267:9:
assertion `left == right` failed
  left: [WindowStarted { window: Window { start_ms: 1717545600000, end_ms: 1717549200000 } }, Page { window: Window { start_ms: 1717545600000, end_ms: 1717549200000 }, events: 0, bytes_so_far: 0 }, WindowDone { window: Window { start_ms: 1717545600000, end_ms: 1717549200000 }, records: 0 }]
 right: [WindowSkipped { window: Window { start_ms: 1717545600000, end_ms: 1717549200000 } }]

---- job::tests::idempotent_skip_when_manifest_exists stdout ----

thread 'job::tests::idempotent_skip_when_manifest_exists' (2479943) panicked at crates/s4logs-drain/src/job.rs:766:9:
assertion `left == right` failed
  left: 0
 right: 1

---- job::tests::skip_does_not_touch_cw stdout ----

thread 'job::tests::skip_does_not_touch_cw' (2479955) panicked at crates/s4logs-drain/src/job.rs:785:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    job::tests::idempotent_skip_when_manifest_exists
    job::tests::progress_reports_skipped_windows
    job::tests::skip_does_not_touch_cw
    retention::tests::corrupt_or_partial_manifest_does_not_count_as_coverage
    retention::tests::full_coverage_allows_and_applies
    retention::tests::gap_refuses_even_with_apply_true
    retention::tests::mid_window_cutoff_requires_containing_window
    retention::tests::report_only_never_applies

test result: FAILED. 66 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
