*** crates/s4logs-drain/src/manifest.rs:145:17: replace && with || in manifest_covers_window

*** mutation diff:
--- crates/s4logs-drain/src/manifest.rs
+++ replace && with || in manifest_covers_window
@@ -137,17 +137,17 @@
     window_start_ms: i64,
     window_end_ms: i64,
 ) -> bool {
     match Manifest::from_json_bytes(bytes) {
         Ok(m) => {
             m.account == account
                 && m.log_group == log_group
                 && m.window_start_ms == window_start_ms
-                && m.window_end_ms == window_end_ms
+                || /* ~ changed by cargo-mutants ~ */ m.window_end_ms == window_end_ms
         }
         Err(_) => false,
     }
 }
 
 /// Parse the window out of a manifest key
 /// (`…/window={start_ms}-{end_ms}.json`). Returns `None` for foreign keys.
 /// Window timestamps are non-negative by construction ([`crate::window`]).

---- retention::tests::corrupt_or_partial_manifest_does_not_count_as_coverage stdout ----

thread 'retention::tests::corrupt_or_partial_manifest_does_not_count_as_coverage' (2485478) panicked at crates/s4logs-drain/src/retention.rs:350:9:
account-mismatched manifest is a gap

failures:
    retention::tests::corrupt_or_partial_manifest_does_not_count_as_coverage

test result: FAILED. 73 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
