*** crates/s4logs-drain/src/manifest.rs:145:36: replace == with != in manifest_covers_window

*** mutation diff:
--- crates/s4logs-drain/src/manifest.rs
+++ replace == with != in manifest_covers_window
@@ -137,17 +137,17 @@
     window_start_ms: i64,
     window_end_ms: i64,
 ) -> bool {
     match Manifest::from_json_bytes(bytes) {
         Ok(m) => {
             m.account == account
                 && m.log_group == log_group
                 && m.window_start_ms == window_start_ms
-                && m.window_end_ms == window_end_ms
+                && m.window_end_ms != /* ~ changed by cargo-mutants ~ */ window_end_ms
         }
         Err(_) => false,
     }
 }
 
 /// Parse the window out of a manifest key
 /// (`…/window={start_ms}-{end_ms}.json`). Returns `None` for foreign keys.
 /// Window timestamps are non-negative by construction ([`crate::window`]).

---- job::tests::skip_does_not_touch_cw stdout ----

thread 'job::tests::skip_does_not_touch_cw' (2516410) panicked at crates/s4logs-drain/src/job.rs:785:9:
assertion `left == right` failed
  left: 1
 right: 0

---- retention::tests::mid_window_cutoff_requires_containing_window stdout ----

thread 'retention::tests::mid_window_cutoff_requires_containing_window' (2516446) panicked at crates/s4logs-drain/src/retention.rs:281:9:
assertion `left == right` failed
  left: [Window { start_ms: 1717545600000, end_ms: 1717549200000 }, Window { start_ms: 1717549200000, end_ms: 1717552800000 }]
 right: [Window { start_ms: 1717549200000, end_ms: 1717552800000 }]

---- retention::tests::gap_refuses_even_with_apply_true stdout ----

thread 'retention::tests::gap_refuses_even_with_apply_true' (2516444) panicked at crates/s4logs-drain/src/retention.rs:239:9:
assertion `left == right` failed
 right: [Window { start_ms: 1717689600000, end_ms: 1717693200000 }]

failures:
    job::tests::idempotent_skip_when_manifest_exists
    job::tests::progress_reports_skipped_windows
    job::tests::skip_does_not_touch_cw
    retention::tests::corrupt_or_partial_manifest_does_not_count_as_coverage
    retention::tests::full_coverage_allows_and_applies
    retention::tests::gap_refuses_even_with_apply_true
    retention::tests::mid_window_cutoff_requires_containing_window
    retention::tests::report_only_never_applies

test result: FAILED. 66 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
