*** crates/s4logs-drain/src/manifest.rs:155:5: replace parse_manifest_key_window -> Option<Window> with None

*** mutation diff:
--- crates/s4logs-drain/src/manifest.rs
+++ replace parse_manifest_key_window -> Option<Window> with None
@@ -147,23 +147,17 @@
         Err(_) => false,
     }
 }
 
 /// Parse the window out of a manifest key
 /// (`…/window={start_ms}-{end_ms}.json`). Returns `None` for foreign keys.
 /// Window timestamps are non-negative by construction ([`crate::window`]).
 pub fn parse_manifest_key_window(key: &str) -> Option<Window> {
-    let base = key.rsplit('/').next()?;
-    let inner = base.strip_prefix("window=")?.strip_suffix(".json")?;
-    let (s, e) = inner.split_once('-')?;
-    Some(Window {
-        start_ms: s.parse().ok()?,
-        end_ms: e.parse().ok()?,
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Manifest prefix covering every log group of one account
 /// (`{prefix}manifest/account={acct}/`) — `s4logs report` lists this once
 /// and filters by [`crate::discover::GroupSelector`] instead of touching
 /// CloudWatch.
 pub fn manifest_account_prefix(prefix: &str, account: &str) -> String {
     format!(

---- manifest::tests::parse_window_from_layout_key stdout ----

thread 'manifest::tests::parse_window_from_layout_key' (2527893) panicked at crates/s4logs-drain/src/manifest.rs:448:9:
assertion `left == right` failed
  left: None
 right: Some(Window { start_ms: 1000, end_ms: 2000 })

failures:
    manifest::tests::parse_window_from_layout_key

test result: FAILED. 73 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
