*** crates/s4logs-drain/src/manifest.rs:218:9: replace MemoryManifestStore::is_empty -> bool with false

*** mutation diff:
--- crates/s4logs-drain/src/manifest.rs
+++ replace MemoryManifestStore::is_empty -> bool with false
@@ -210,20 +210,17 @@
             .lock()
             .unwrap_or_else(|e| e.into_inner())
             .keys()
             .cloned()
             .collect()
     }
 
     pub fn is_empty(&self) -> bool {
-        self.objects
-            .lock()
-            .unwrap_or_else(|e| e.into_inner())
-            .is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[async_trait]
 impl ManifestStore for MemoryManifestStore {
     async fn exists(&self, key: &str) -> Result<bool, ManifestError> {
         Ok(self
             .objects

---- job::tests::dry_run_writes_nothing_but_counts_everything stdout ----

thread 'job::tests::dry_run_writes_nothing_but_counts_everything' (2593302) panicked at crates/s4logs-drain/src/job.rs:831:9:
dry-run wrote manifests

---- job::tests::throttling_surfaces_as_typed_error stdout ----

thread 'job::tests::throttling_surfaces_as_typed_error' (2593319) panicked at crates/s4logs-drain/src/job.rs:900:9:
no manifest may exist for a failed window

failures:
    job::tests::dry_run_writes_nothing_but_counts_everything
    job::tests::throttling_surfaces_as_typed_error

test result: FAILED. 72 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
