*** crates/s4logs-drain/src/manifest.rs:228:9: replace <impl ManifestStore for MemoryManifestStore>::exists -> Result<bool, ManifestError> with Ok(true)

*** mutation diff:
--- crates/s4logs-drain/src/manifest.rs
+++ replace <impl ManifestStore for MemoryManifestStore>::exists -> Result<bool, ManifestError> with Ok(true)
@@ -220,21 +220,17 @@
             .unwrap_or_else(|e| e.into_inner())
             .is_empty()
     }
 }
 
 #[async_trait]
 impl ManifestStore for MemoryManifestStore {
     async fn exists(&self, key: &str) -> Result<bool, ManifestError> {
-        Ok(self
-            .objects
-            .lock()
-            .unwrap_or_else(|e| e.into_inner())
-            .contains_key(key))
+        Ok(true) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get(&self, key: &str) -> Result<Option<Bytes>, ManifestError> {
         Ok(self
             .objects
             .lock()
             .unwrap_or_else(|e| e.into_inner())
             .get(key)

---- manifest::tests::memory_store_list_is_prefix_scoped stdout ----

thread 'manifest::tests::memory_store_list_is_prefix_scoped' (2600891) panicked at crates/s4logs-drain/src/manifest.rs:468:9:
assertion failed: !store.exists("c/1").await.unwrap()

---- job::tests::multi_group_failure_is_skipped_and_aggregated stdout ----

thread 'job::tests::multi_group_failure_is_skipped_and_aggregated' (2600872) panicked at crates/s4logs-drain/src/job.rs:1033:9:
assertion failed: !manifests.exists(&manifest_key("s4logs", ACCT, "/g/bad", DAY0,
                        DAY0 + HOUR_MS)).await.unwrap()

failures:
    job::tests::multi_group_failure_is_skipped_and_aggregated
    manifest::tests::memory_store_list_is_prefix_scoped

test result: FAILED. 72 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
