*** crates/s4logs-drain/src/manifest.rs:228:9: replace <impl ManifestStore for MemoryManifestStore>::exists -> Result<bool, ManifestError> with Ok(false)

*** mutation diff:
--- crates/s4logs-drain/src/manifest.rs
+++ replace <impl ManifestStore for MemoryManifestStore>::exists -> Result<bool, ManifestError> with Ok(false)
@@ -220,21 +220,17 @@
             .unwrap_or_else(|e| e.into_inner())
             .is_empty()
     }
 }
 
 #[async_trait]
 impl ManifestStore for MemoryManifestStore {
     async fn exists(&self, key: &str) -> Result<bool, ManifestError> {
-        Ok(self
-            .objects
-            .lock()
-            .unwrap_or_else(|e| e.into_inner())
-            .contains_key(key))
+        Ok(false) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get(&self, key: &str) -> Result<Option<Bytes>, ManifestError> {
         Ok(self
             .objects
             .lock()
             .unwrap_or_else(|e| e.into_inner())
             .get(key)

---- job::tests::from_defaults_to_log_group_creation_time stdout ----

thread 'job::tests::from_defaults_to_log_group_creation_time' (2604007) panicked at crates/s4logs-drain/src/job.rs:937:9:
assertion failed: manifests.exists(&manifest_key("s4logs", ACCT, GROUP, DAY0,
                    DAY0 + HOUR_MS)).await.unwrap()

---- manifest::tests::memory_store_list_is_prefix_scoped stdout ----

thread 'manifest::tests::memory_store_list_is_prefix_scoped' (2604041) panicked at crates/s4logs-drain/src/manifest.rs:467:9:
assertion failed: store.exists("b/1").await.unwrap()

---- job::tests::multi_group_failure_is_skipped_and_aggregated stdout ----

thread 'job::tests::multi_group_failure_is_skipped_and_aggregated' (2604010) panicked at crates/s4logs-drain/src/job.rs:1021:9:
assertion failed: manifests.exists(&manifest_key("s4logs", ACCT, "/g/a", DAY0,
                    DAY0 + HOUR_MS)).await.unwrap()

failures:
    job::tests::from_defaults_to_log_group_creation_time
    job::tests::multi_group_failure_is_skipped_and_aggregated
    manifest::tests::memory_store_list_is_prefix_scoped

test result: FAILED. 71 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
