*** crates/s4logs-drain/src/manifest.rs:236:9: replace <impl ManifestStore for MemoryManifestStore>::get -> Result<Option<Bytes>, ManifestError> with Ok(None)

*** mutation diff:
--- crates/s4logs-drain/src/manifest.rs
+++ replace <impl ManifestStore for MemoryManifestStore>::get -> Result<Option<Bytes>, ManifestError> with Ok(None)
@@ -228,22 +228,17 @@
         Ok(self
             .objects
             .lock()
             .unwrap_or_else(|e| e.into_inner())
             .contains_key(key))
     }
 
     async fn get(&self, key: &str) -> Result<Option<Bytes>, ManifestError> {
-        Ok(self
-            .objects
-            .lock()
-            .unwrap_or_else(|e| e.into_inner())
-            .get(key)
-            .cloned())
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn put(&self, key: &str, body: Bytes) -> Result<(), ManifestError> {
         self.objects
             .lock()
             .unwrap_or_else(|e| e.into_inner())
             .insert(key.to_owned(), body);
         Ok(())

---- job::tests::progress_reports_skipped_windows stdout ----

thread 'job::tests::progress_reports_skipped_windows' (2614491) panicked at crates/s4logs-drain/src/job.rs:1267:9:
assertion `left == right` failed
  left: [WindowStarted { window: Window { start_ms: 1717545600000, end_ms: 1717549200000 } }, Page { window: Window { start_ms: 1717545600000, end_ms: 1717549200000 }, events: 0, bytes_so_far: 0 }, WindowDone { window: Window { start_ms: 1717545600000, end_ms: 1717549200000 }, records: 0 }]
 right: [WindowSkipped { window: Window { start_ms: 1717545600000, end_ms: 1717549200000 } }]

---- job::tests::idempotent_skip_when_manifest_exists stdout ----

thread 'job::tests::idempotent_skip_when_manifest_exists' (2614484) panicked at crates/s4logs-drain/src/job.rs:766:9:
assertion `left == right` failed
  left: 0
 right: 1

---- manifest::tests::memory_store_list_is_prefix_scoped stdout ----

thread 'manifest::tests::memory_store_list_is_prefix_scoped' (2614506) panicked at crates/s4logs-drain/src/manifest.rs:469:45:
called `Option::unwrap()` on a `None` value

failures:
    job::tests::empty_window_writes_manifest_with_no_objects
    job::tests::idempotent_skip_when_manifest_exists
    job::tests::out_of_window_events_are_dropped_not_archived
    job::tests::pagination_rotation_and_manifest
    job::tests::progress_reports_skipped_windows
    job::tests::sharded_drain_archives_the_same_record_set_as_unsharded
    job::tests::skip_does_not_touch_cw
    manifest::tests::memory_store_list_is_prefix_scoped
    reconcile::tests::clean_window_leaves_manifest_byte_identical
    reconcile::tests::dry_run_counts_but_writes_nothing
    reconcile::tests::gateway_records_without_event_id_match_by_content_fallback
    reconcile::tests::late_events_are_appended_and_manifest_updated

test result: FAILED. 53 passed; 21 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
