*** crates/s4logs-drain/src/manifest.rs:245:9: replace <impl ManifestStore for MemoryManifestStore>::put -> Result<(), ManifestError> with Ok(())

*** mutation diff:
--- crates/s4logs-drain/src/manifest.rs
+++ replace <impl ManifestStore for MemoryManifestStore>::put -> Result<(), ManifestError> with Ok(())
@@ -237,21 +237,17 @@
             .objects
             .lock()
             .unwrap_or_else(|e| e.into_inner())
             .get(key)
             .cloned())
     }
 
     async fn put(&self, key: &str, body: Bytes) -> Result<(), ManifestError> {
-        self.objects
-            .lock()
-            .unwrap_or_else(|e| e.into_inner())
-            .insert(key.to_owned(), body);
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn list(&self, prefix: &str) -> Result<Vec<String>, ManifestError> {
         Ok(self
             .objects
             .lock()
             .unwrap_or_else(|e| e.into_inner())
             .range(prefix.to_owned()..)

---- job::tests::progress_reports_skipped_windows stdout ----

thread 'job::tests::progress_reports_skipped_windows' (2625254) panicked at crates/s4logs-drain/src/job.rs:1267:9:
assertion `left == right` failed
  left: [WindowStarted { window: Window { start_ms: 1717545600000, end_ms: 1717549200000 } }, Page { window: Window { start_ms: 1717545600000, end_ms: 1717549200000 }, events: 0, bytes_so_far: 0 }, WindowDone { window: Window { start_ms: 1717545600000, end_ms: 1717549200000 }, records: 0 }]
 right: [WindowSkipped { window: Window { start_ms: 1717545600000, end_ms: 1717549200000 } }]

---- job::tests::multi_group_failure_is_skipped_and_aggregated stdout ----

thread 'job::tests::multi_group_failure_is_skipped_and_aggregated' (2625249) panicked at crates/s4logs-drain/src/job.rs:1021:9:
assertion failed: manifests.exists(&manifest_key("s4logs", ACCT, "/g/a", DAY0,
                    DAY0 + HOUR_MS)).await.unwrap()

---- job::tests::empty_window_writes_manifest_with_no_objects stdout ----

thread 'job::tests::empty_window_writes_manifest_with_no_objects' (2625245) panicked at crates/s4logs-drain/src/job.rs:797:80:
called `Option::unwrap()` on a `None` value

failures:
    job::tests::empty_window_writes_manifest_with_no_objects
    job::tests::from_defaults_to_log_group_creation_time
    job::tests::idempotent_skip_when_manifest_exists
    job::tests::multi_group_failure_is_skipped_and_aggregated
    job::tests::out_of_window_events_are_dropped_not_archived
    job::tests::pagination_rotation_and_manifest
    job::tests::progress_reports_skipped_windows
    job::tests::sharded_drain_archives_the_same_record_set_as_unsharded
    job::tests::skip_does_not_touch_cw
    manifest::tests::memory_store_list_is_prefix_scoped
    reconcile::tests::clean_window_leaves_manifest_byte_identical
    reconcile::tests::dry_run_counts_but_writes_nothing

test result: FAILED. 51 passed; 23 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
