*** crates/s4logs-drain/src/manifest.rs:253:9: replace <impl ManifestStore for MemoryManifestStore>::list -> Result<Vec<String>, ManifestError> with Ok(vec![String::new()])

*** mutation diff:
--- crates/s4logs-drain/src/manifest.rs
+++ replace <impl ManifestStore for MemoryManifestStore>::list -> Result<Vec<String>, ManifestError> with Ok(vec![String::new()])
@@ -245,24 +245,17 @@
         self.objects
             .lock()
             .unwrap_or_else(|e| e.into_inner())
             .insert(key.to_owned(), body);
         Ok(())
     }
 
     async fn list(&self, prefix: &str) -> Result<Vec<String>, ManifestError> {
-        Ok(self
-            .objects
-            .lock()
-            .unwrap_or_else(|e| e.into_inner())
-            .range(prefix.to_owned()..)
-            .take_while(|(k, _)| k.starts_with(prefix))
-            .map(|(k, _)| k.clone())
-            .collect())
+        Ok(vec![String::new()]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Thin [`ManifestStore`] adapter over the S3 `ObjectStore`.
 ///
 /// COMPILE-ONLY in wave 1B: `ObjectStore`'s S3 calls are implemented by
 /// wave 1A and integration-tested by wave 2E. Do not add tests here that
 /// would hit the underlying client.

---- manifest::tests::memory_store_list_is_prefix_scoped stdout ----

thread 'manifest::tests::memory_store_list_is_prefix_scoped' (2637534) panicked at crates/s4logs-drain/src/manifest.rs:463:9:
assertion `left == right` failed
  left: [""]
 right: ["a/1", "a/2"]

failures:
    manifest::tests::memory_store_list_is_prefix_scoped

test result: FAILED. 73 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
