*** crates/s4logs-drain/src/retention.rs:100:12: delete ! in plan_retention

*** mutation diff:
--- crates/s4logs-drain/src/retention.rs
+++ delete ! in plan_retention
@@ -92,17 +92,17 @@
             w.end_ms,
         );
         let covered = match manifests.get(&key).await? {
             None => false,
             Some(bytes) => {
                 manifest_covers_window(&bytes, &req.account, &req.log_group, w.start_ms, w.end_ms)
             }
         };
-        if !covered {
+        if  /* ~ changed by cargo-mutants ~ */covered {
             missing_windows.push(*w);
         }
     }
     Ok(RetentionPlan {
         log_group: req.log_group.clone(),
         retention_days: req.retention_days,
         cutoff_ms,
         required_windows,

---- retention::tests::mid_window_cutoff_requires_containing_window stdout ----

thread 'retention::tests::mid_window_cutoff_requires_containing_window' (2719622) panicked at crates/s4logs-drain/src/retention.rs:281:9:
assertion `left == right` failed
  left: [Window { start_ms: 1717545600000, end_ms: 1717549200000 }]
 right: [Window { start_ms: 1717549200000, end_ms: 1717552800000 }]

---- retention::tests::corrupt_or_partial_manifest_does_not_count_as_coverage stdout ----

thread 'retention::tests::corrupt_or_partial_manifest_does_not_count_as_coverage' (2719619) panicked at crates/s4logs-drain/src/retention.rs:331:9:
zero-byte manifests must not satisfy coverage

---- retention::tests::report_only_never_applies stdout ----

thread 'retention::tests::report_only_never_applies' (2719625) panicked at crates/s4logs-drain/src/retention.rs:260:9:
assertion failed: plan.allowed()

failures:
    retention::tests::corrupt_or_partial_manifest_does_not_count_as_coverage
    retention::tests::full_coverage_allows_and_applies
    retention::tests::gap_refuses_even_with_apply_true
    retention::tests::mid_window_cutoff_requires_containing_window
    retention::tests::report_only_never_applies

test result: FAILED. 69 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
