*** crates/s4logs-drain/src/retention.rs:125:8: delete ! in enforce_retention

*** mutation diff:
--- crates/s4logs-drain/src/retention.rs
+++ delete ! in enforce_retention
@@ -117,17 +117,17 @@
 pub async fn enforce_retention(
     cw: &dyn CwSource,
     manifests: &dyn ManifestStore,
     key_prefix: &str,
     req: &RetentionRequest,
     apply: bool,
 ) -> Result<RetentionPlan, DrainError> {
     let mut plan = plan_retention(manifests, key_prefix, req).await?;
-    if !plan.allowed() {
+    if  /* ~ changed by cargo-mutants ~ */plan.allowed() {
         tracing::warn!(
             log_group = %req.log_group,
             missing = plan.missing_windows.len(),
             required = plan.required_windows.len(),
             "retention gate refused: coverage gap (fail-closed, nothing changed)"
         );
         return Ok(plan);
     }

---- retention::tests::full_coverage_allows_and_applies stdout ----

thread 'retention::tests::full_coverage_allows_and_applies' (2725027) panicked at crates/s4logs-drain/src/retention.rs:217:9:
assertion failed: plan.applied

---- retention::tests::gap_refuses_even_with_apply_true stdout ----

thread 'retention::tests::gap_refuses_even_with_apply_true' (2725028) panicked at crates/s4logs-drain/src/retention.rs:238:9:
assertion failed: !plan.applied

failures:
    retention::tests::full_coverage_allows_and_applies
    retention::tests::gap_refuses_even_with_apply_true

test result: FAILED. 72 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
