*** crates/s4logs-drain/src/retention.rs:54:9: replace RetentionPlan::allowed -> bool with true

*** mutation diff:
--- crates/s4logs-drain/src/retention.rs
+++ replace RetentionPlan::allowed -> bool with true
@@ -46,17 +46,17 @@
     /// Required windows with no manifest — must be empty to proceed.
     pub missing_windows: Vec<Window>,
     pub applied: bool,
 }
 
 impl RetentionPlan {
     /// Fail-closed verdict: true only when every required window is covered.
     pub fn allowed(&self) -> bool {
-        self.missing_windows.is_empty()
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Compute coverage without touching CloudWatch (report-only path).
 pub async fn plan_retention(
     manifests: &dyn ManifestStore,
     key_prefix: &str,
     req: &RetentionRequest,

---- retention::tests::corrupt_or_partial_manifest_does_not_count_as_coverage stdout ----

thread 'retention::tests::corrupt_or_partial_manifest_does_not_count_as_coverage' (2693179) panicked at crates/s4logs-drain/src/retention.rs:331:9:
zero-byte manifests must not satisfy coverage

---- retention::tests::gap_refuses_even_with_apply_true stdout ----

thread 'retention::tests::gap_refuses_even_with_apply_true' (2693182) panicked at crates/s4logs-drain/src/retention.rs:237:9:
assertion failed: !plan.allowed()

---- retention::tests::mid_window_cutoff_requires_containing_window stdout ----

thread 'retention::tests::mid_window_cutoff_requires_containing_window' (2693183) panicked at crates/s4logs-drain/src/retention.rs:288:9:
assertion failed: !plan.allowed()

failures:
    retention::tests::corrupt_or_partial_manifest_does_not_count_as_coverage
    retention::tests::gap_refuses_even_with_apply_true
    retention::tests::mid_window_cutoff_requires_containing_window

test result: FAILED. 71 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
