*** crates/s4logs-drain/src/retention.rs:54:9: replace RetentionPlan::allowed -> bool with false

*** mutation diff:
--- crates/s4logs-drain/src/retention.rs
+++ replace RetentionPlan::allowed -> bool with false
@@ -46,17 +46,17 @@
     /// Required windows with no manifest — must be empty to proceed.
     pub missing_windows: Vec<Window>,
     pub applied: bool,
 }
 
 impl RetentionPlan {
     /// Fail-closed verdict: true only when every required window is covered.
     pub fn allowed(&self) -> bool {
-        self.missing_windows.is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Compute coverage without touching CloudWatch (report-only path).
 pub async fn plan_retention(
     manifests: &dyn ManifestStore,
     key_prefix: &str,
     req: &RetentionRequest,

---- retention::tests::full_coverage_allows_and_applies stdout ----

thread 'retention::tests::full_coverage_allows_and_applies' (2698190) panicked at crates/s4logs-drain/src/retention.rs:216:9:
assertion failed: plan.allowed()

---- retention::tests::no_data_older_than_cutoff_is_trivially_allowed stdout ----

thread 'retention::tests::no_data_older_than_cutoff_is_trivially_allowed' (2698193) panicked at crates/s4logs-drain/src/retention.rs:297:9:
assertion failed: plan.allowed()

---- retention::tests::report_only_never_applies stdout ----

thread 'retention::tests::report_only_never_applies' (2698195) panicked at crates/s4logs-drain/src/retention.rs:260:9:
assertion failed: plan.allowed()

failures:
    retention::tests::full_coverage_allows_and_applies
    retention::tests::no_data_older_than_cutoff_is_trivially_allowed
    retention::tests::report_only_never_applies

test result: FAILED. 71 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
