*** crates/s4logs-drain/src/retention.rs:64:27: replace <= with > in plan_retention

*** mutation diff:
--- crates/s4logs-drain/src/retention.rs
+++ replace <= with > in plan_retention
@@ -56,17 +56,17 @@
 }
 
 /// Compute coverage without touching CloudWatch (report-only path).
 pub async fn plan_retention(
     manifests: &dyn ManifestStore,
     key_prefix: &str,
     req: &RetentionRequest,
 ) -> Result<RetentionPlan, DrainError> {
-    if req.retention_days <= 0 {
+    if req.retention_days > /* ~ changed by cargo-mutants ~ */ 0 {
         return Err(DrainError::BadOptions(format!(
             "retention_days must be > 0, got {}",
             req.retention_days
         )));
     }
     let cutoff_ms = req
         .now_ms
         .saturating_sub(i64::from(req.retention_days).saturating_mul(DAY_MS));

---- retention::tests::mid_window_cutoff_requires_containing_window stdout ----

thread 'retention::tests::mid_window_cutoff_requires_containing_window' (2708054) panicked at crates/s4logs-drain/src/retention.rs:279:61:
called `Result::unwrap()` on an `Err` value: BadOptions("retention_days must be > 0, got 1")

---- retention::tests::corrupt_or_partial_manifest_does_not_count_as_coverage stdout ----

thread 'retention::tests::corrupt_or_partial_manifest_does_not_count_as_coverage' (2708051) panicked at crates/s4logs-drain/src/retention.rs:332:55:
called `Result::unwrap()` on an `Err` value: BadOptions("retention_days must be > 0, got 7")

---- retention::tests::no_data_older_than_cutoff_is_trivially_allowed stdout ----

thread 'retention::tests::no_data_older_than_cutoff_is_trivially_allowed' (2708055) panicked at crates/s4logs-drain/src/retention.rs:296:61:
called `Result::unwrap()` on an `Err` value: BadOptions("retention_days must be > 0, got 7")

failures:
    retention::tests::corrupt_or_partial_manifest_does_not_count_as_coverage
    retention::tests::full_coverage_allows_and_applies
    retention::tests::gap_refuses_even_with_apply_true
    retention::tests::mid_window_cutoff_requires_containing_window
    retention::tests::no_data_older_than_cutoff_is_trivially_allowed
    retention::tests::rejects_non_positive_retention
    retention::tests::report_only_never_applies

test result: FAILED. 67 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
