*** crates/s4logs-drain/src/retention.rs:73:41: replace <= with > in plan_retention

*** mutation diff:
--- crates/s4logs-drain/src/retention.rs
+++ replace <= with > in plan_retention
@@ -65,17 +65,17 @@
         return Err(DrainError::BadOptions(format!(
             "retention_days must be > 0, got {}",
             req.retention_days
         )));
     }
     let cutoff_ms = req
         .now_ms
         .saturating_sub(i64::from(req.retention_days).saturating_mul(DAY_MS));
-    let required_windows = if cutoff_ms <= req.coverage_from_ms {
+    let required_windows = if cutoff_ms > /* ~ changed by cargo-mutants ~ */ req.coverage_from_ms {
         // Nothing older than the cutoff can exist — trivially safe.
         Vec::new()
     } else {
         windows_covering(req.coverage_from_ms, cutoff_ms, req.window_ms)?
     };
     // This gate decides whether CloudWatch may DELETE logs, so a key merely
     // *existing* is not proof of coverage: a zero-byte, truncated,
     // wrong-version, or mismatched manifest object at the expected key would

---- retention::tests::corrupt_or_partial_manifest_does_not_count_as_coverage stdout ----

thread 'retention::tests::corrupt_or_partial_manifest_does_not_count_as_coverage' (2710248) panicked at crates/s4logs-drain/src/retention.rs:331:9:
zero-byte manifests must not satisfy coverage

---- retention::tests::mid_window_cutoff_requires_containing_window stdout ----

thread 'retention::tests::mid_window_cutoff_requires_containing_window' (2710251) panicked at crates/s4logs-drain/src/retention.rs:280:9:
assertion `left == right` failed
  left: 0
 right: 2

---- retention::tests::gap_refuses_even_with_apply_true stdout ----

thread 'retention::tests::gap_refuses_even_with_apply_true' (2710250) panicked at crates/s4logs-drain/src/retention.rs:237:9:
assertion failed: !plan.allowed()

failures:
    retention::tests::corrupt_or_partial_manifest_does_not_count_as_coverage
    retention::tests::full_coverage_allows_and_applies
    retention::tests::gap_refuses_even_with_apply_true
    retention::tests::mid_window_cutoff_requires_containing_window

test result: FAILED. 70 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
