*** crates/s4logs-core/src/chunk.rs:103:32: replace && with || in ChunkWriter::is_empty

*** mutation diff:
--- crates/s4logs-core/src/chunk.rs
+++ replace && with || in ChunkWriter::is_empty
@@ -95,17 +95,17 @@
             original_off: 0,
             record_count: 0,
             min_ts: i64::MAX,
             max_ts: i64::MIN,
         }
     }
 
     pub fn is_empty(&self) -> bool {
-        self.record_count == 0 && self.pending_records == 0
+        self.record_count == 0 || /* ~ changed by cargo-mutants ~ */ self.pending_records == 0
     }
 
     /// Total uncompressed bytes accepted so far (flush-threshold signal for
     /// the gateway buffer).
     pub fn uncompressed_len(&self) -> u64 {
         self.original_off + self.pending.len() as u64
     }

---- chunk::tests::accessors_track_pushed_records stdout ----

thread 'chunk::tests::accessors_track_pushed_records' (2633598) panicked at crates/s4logs-core/src/chunk.rs:285:9:
assertion failed: !w.is_empty()

failures:
    chunk::tests::accessors_track_pushed_records

test result: FAILED. 42 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
