*** crates/s4logs-core/src/chunk.rs:109:27: replace + with - in ChunkWriter::uncompressed_len

*** mutation diff:
--- crates/s4logs-core/src/chunk.rs
+++ replace + with - in ChunkWriter::uncompressed_len
@@ -101,17 +101,17 @@
 
     pub fn is_empty(&self) -> bool {
         self.record_count == 0 && self.pending_records == 0
     }
 
     /// Total uncompressed bytes accepted so far (flush-threshold signal for
     /// the gateway buffer).
     pub fn uncompressed_len(&self) -> u64 {
-        self.original_off + self.pending.len() as u64
+        self.original_off - /* ~ changed by cargo-mutants ~ */ self.pending.len() as u64
     }
 
     pub fn record_count(&self) -> u64 {
         self.record_count + self.pending_records
     }
 
     pub fn push(&mut self, rec: &LogRecord) -> Result<(), ChunkError> {
         rec.append_jsonl(&mut self.pending)?;

*** result: Success
