*** crates/s4logs-core/src/chunk.rs:109:9: replace ChunkWriter::uncompressed_len -> u64 with 1

*** mutation diff:
--- crates/s4logs-core/src/chunk.rs
+++ replace ChunkWriter::uncompressed_len -> u64 with 1
@@ -101,17 +101,17 @@
 
     pub fn is_empty(&self) -> bool {
         self.record_count == 0 && self.pending_records == 0
     }
 
     /// Total uncompressed bytes accepted so far (flush-threshold signal for
     /// the gateway buffer).
     pub fn uncompressed_len(&self) -> u64 {
-        self.original_off + self.pending.len() as u64
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn record_count(&self) -> u64 {
         self.record_count + self.pending_records
     }
 
     pub fn push(&mut self, rec: &LogRecord) -> Result<(), ChunkError> {
         rec.append_jsonl(&mut self.pending)?;

---- chunk::tests::accessors_track_pushed_records stdout ----

thread 'chunk::tests::accessors_track_pushed_records' (1868315) panicked at crates/s4logs-core/src/chunk.rs:279:9:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    chunk::tests::accessors_track_pushed_records

test result: FAILED. 42 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
