*** crates/s4logs-core/src/chunk.rs:117:9: replace ChunkWriter::push -> Result<(), ChunkError> with Ok(())

*** mutation diff:
--- crates/s4logs-core/src/chunk.rs
+++ replace ChunkWriter::push -> Result<(), ChunkError> with Ok(())
@@ -109,24 +109,17 @@
         self.original_off + self.pending.len() as u64
     }
 
     pub fn record_count(&self) -> u64 {
         self.record_count + self.pending_records
     }
 
     pub fn push(&mut self, rec: &LogRecord) -> Result<(), ChunkError> {
-        rec.append_jsonl(&mut self.pending)?;
-        self.pending_min_ts = self.pending_min_ts.min(rec.timestamp);
-        self.pending_max_ts = self.pending_max_ts.max(rec.timestamp);
-        self.pending_records += 1;
-        if self.pending.len() >= self.cfg.frame_target_bytes {
-            self.cut_frame()?;
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn cut_frame(&mut self) -> Result<(), ChunkError> {
         if self.pending.is_empty() {
             return Ok(());
         }
         let compressed = compress_frame(&self.pending, self.cfg.zstd_level)?;
         self.entries.push(FrameIndexEntry {

---- chunk::tests::accessors_track_pushed_records stdout ----

thread 'chunk::tests::accessors_track_pushed_records' (2158887) panicked at crates/s4logs-core/src/chunk.rs:278:9:
assertion failed: !w.is_empty()

---- chunk::tests::encode_does_not_consume_and_matches_finish stdout ----

thread 'chunk::tests::encode_does_not_consume_and_matches_finish' (2158889) panicked at crates/s4logs-core/src/chunk.rs:295:37:
called `Option::unwrap()` on a `None` value

---- chunk::tests::single_frame_roundtrips_via_plain_zstd stdout ----

thread 'chunk::tests::single_frame_roundtrips_via_plain_zstd' (2158891) panicked at crates/s4logs-core/src/chunk.rs:245:41:
called `Option::unwrap()` on a `None` value

failures:
    chunk::tests::accessors_track_pushed_records
    chunk::tests::encode_does_not_consume_and_matches_finish
    chunk::tests::multi_frame_cut_and_concatenated_decode
    chunk::tests::single_frame_roundtrips_via_plain_zstd
    read::tests::bomb_cap_stops_decoding_early
    read::tests::coalesce_merges_adjacent_frames
    read::tests::decompress_cap_boundary_rejects_at_exactly_cap
    read::tests::mismatched_sidecars_rejected
    read::tests::prune_then_decompress_selected_frames
    read::tests::undersized_claim_within_cap_rejected_as_size_mismatch
    sink::tests::memory_sink_stores_data_and_stamped_sidecars
    store::tests::put_chunk_data_failure_skips_sidecars

test result: FAILED. 27 passed; 16 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
