*** crates/s4logs-core/src/chunk.rs:121:31: replace >= with < in ChunkWriter::push

*** mutation diff:
--- crates/s4logs-core/src/chunk.rs
+++ replace >= with < in ChunkWriter::push
@@ -113,17 +113,17 @@
         self.record_count + self.pending_records
     }
 
     pub fn push(&mut self, rec: &LogRecord) -> Result<(), ChunkError> {
         rec.append_jsonl(&mut self.pending)?;
         self.pending_min_ts = self.pending_min_ts.min(rec.timestamp);
         self.pending_max_ts = self.pending_max_ts.max(rec.timestamp);
         self.pending_records += 1;
-        if self.pending.len() >= self.cfg.frame_target_bytes {
+        if self.pending.len() < /* ~ changed by cargo-mutants ~ */ self.cfg.frame_target_bytes {
             self.cut_frame()?;
         }
         Ok(())
     }
 
     fn cut_frame(&mut self) -> Result<(), ChunkError> {
         if self.pending.is_empty() {
             return Ok(());

---- chunk::tests::single_frame_roundtrips_via_plain_zstd stdout ----

thread 'chunk::tests::single_frame_roundtrips_via_plain_zstd' (2250012) panicked at crates/s4logs-core/src/chunk.rs:256:9:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    chunk::tests::single_frame_roundtrips_via_plain_zstd

test result: FAILED. 42 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
