*** crates/s4logs-core/src/chunk.rs:128:9: replace ChunkWriter::cut_frame -> Result<(), ChunkError> with Ok(())

*** mutation diff:
--- crates/s4logs-core/src/chunk.rs
+++ replace ChunkWriter::cut_frame -> Result<(), ChunkError> with Ok(())
@@ -120,40 +120,17 @@
         self.pending_records += 1;
         if self.pending.len() >= self.cfg.frame_target_bytes {
             self.cut_frame()?;
         }
         Ok(())
     }
 
     fn cut_frame(&mut self) -> Result<(), ChunkError> {
-        if self.pending.is_empty() {
-            return Ok(());
-        }
-        let compressed = compress_frame(&self.pending, self.cfg.zstd_level)?;
-        self.entries.push(FrameIndexEntry {
-            original_offset: self.original_off,
-            original_size: self.pending.len() as u64,
-            compressed_offset: self.body.len() as u64,
-            compressed_size: compressed.len() as u64,
-        });
-        self.ts_entries.push(TsEntry {
-            min_ts: self.pending_min_ts,
-            max_ts: self.pending_max_ts,
-        });
-        self.original_off += self.pending.len() as u64;
-        self.body.extend_from_slice(&compressed);
-        self.record_count += self.pending_records;
-        self.min_ts = self.min_ts.min(self.pending_min_ts);
-        self.max_ts = self.max_ts.max(self.pending_max_ts);
-        self.pending.clear();
-        self.pending_min_ts = i64::MAX;
-        self.pending_max_ts = i64::MIN;
-        self.pending_records = 0;
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Finalize, consuming the writer. Returns `None` if no record was pushed.
     pub fn finish(self) -> Result<Option<EncodedChunk>, ChunkError> {
         self.encode()
     }
 
     /// Encode **without consuming** the writer — the buffer stays usable, so

---- chunk::tests::multi_frame_cut_and_concatenated_decode stdout ----

thread 'chunk::tests::multi_frame_cut_and_concatenated_decode' (2269928) panicked at crates/s4logs-core/src/chunk.rs:300:9:
expected multiple frames

---- read::tests::prune_then_decompress_selected_frames stdout ----

thread 'read::tests::prune_then_decompress_selected_frames' (2269950) panicked at crates/s4logs-core/src/read.rs:204:9:
assertion failed: spans.len() < chunk.frame_index.entries.len()

failures:
    chunk::tests::multi_frame_cut_and_concatenated_decode
    read::tests::prune_then_decompress_selected_frames

test result: FAILED. 41 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
