*** crates/s4logs-core/src/chunk.rs:144:27: replace += with *= in ChunkWriter::cut_frame

*** mutation diff:
--- crates/s4logs-core/src/chunk.rs
+++ replace += with *= in ChunkWriter::cut_frame
@@ -136,17 +136,17 @@
             compressed_size: compressed.len() as u64,
         });
         self.ts_entries.push(TsEntry {
             min_ts: self.pending_min_ts,
             max_ts: self.pending_max_ts,
         });
         self.original_off += self.pending.len() as u64;
         self.body.extend_from_slice(&compressed);
-        self.record_count += self.pending_records;
+        self.record_count *= /* ~ changed by cargo-mutants ~ */ self.pending_records;
         self.min_ts = self.min_ts.min(self.pending_min_ts);
         self.max_ts = self.max_ts.max(self.pending_max_ts);
         self.pending.clear();
         self.pending_min_ts = i64::MAX;
         self.pending_max_ts = i64::MIN;
         self.pending_records = 0;
         Ok(())
     }

---- chunk::tests::accessors_track_pushed_records stdout ----

thread 'chunk::tests::accessors_track_pushed_records' (2331892) panicked at crates/s4logs-core/src/chunk.rs:285:9:
assertion failed: !w.is_empty()

failures:
    chunk::tests::accessors_track_pushed_records

test result: FAILED. 42 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
