*** crates/s4logs-core/src/chunk.rs:156:9: replace ChunkWriter::finish -> Result<Option<EncodedChunk>, ChunkError> with Ok(None)

*** mutation diff:
--- crates/s4logs-core/src/chunk.rs
+++ replace ChunkWriter::finish -> Result<Option<EncodedChunk>, ChunkError> with Ok(None)
@@ -148,17 +148,17 @@
         self.pending_min_ts = i64::MAX;
         self.pending_max_ts = i64::MIN;
         self.pending_records = 0;
         Ok(())
     }
 
     /// Finalize, consuming the writer. Returns `None` if no record was pushed.
     pub fn finish(self) -> Result<Option<EncodedChunk>, ChunkError> {
-        self.encode()
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Encode **without consuming** the writer — the buffer stays usable, so
     /// a caller whose store PUT fails can retry the same writer instead of
     /// losing the events (gateway flush-failure recovery). The already-cut
     /// frames are reused; only the uncut `pending` tail is compressed here,
     /// into a clone, so `self` is untouched.
     pub fn encode(&self) -> Result<Option<EncodedChunk>, ChunkError> {

---- chunk::tests::encode_does_not_consume_and_matches_finish stdout ----

thread 'chunk::tests::encode_does_not_consume_and_matches_finish' (2344304) panicked at crates/s4logs-core/src/chunk.rs:308:37:
called `Option::unwrap()` on a `None` value

---- chunk::tests::multi_frame_cut_and_concatenated_decode stdout ----

thread 'chunk::tests::multi_frame_cut_and_concatenated_decode' (2344305) panicked at crates/s4logs-core/src/chunk.rs:322:41:
called `Option::unwrap()` on a `None` value

---- chunk::tests::single_frame_roundtrips_via_plain_zstd stdout ----

thread 'chunk::tests::single_frame_roundtrips_via_plain_zstd' (2344310) panicked at crates/s4logs-core/src/chunk.rs:252:41:
called `Option::unwrap()` on a `None` value

failures:
    chunk::tests::encode_does_not_consume_and_matches_finish
    chunk::tests::multi_frame_cut_and_concatenated_decode
    chunk::tests::single_frame_roundtrips_via_plain_zstd
    read::tests::bomb_cap_stops_decoding_early
    read::tests::coalesce_merges_adjacent_frames
    read::tests::decompress_cap_boundary_rejects_at_exactly_cap
    read::tests::mismatched_sidecars_rejected
    read::tests::prune_then_decompress_selected_frames
    read::tests::undersized_claim_within_cap_rejected_as_size_mismatch
    sink::tests::memory_sink_stores_data_and_stamped_sidecars
    store::tests::put_chunk_data_failure_skips_sidecars
    store::tests::put_chunk_sidecar_failure_surfaces

test result: FAILED. 28 passed; 15 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
