*** crates/s4logs-core/src/chunk.rs:184:26: replace += with *= in ChunkWriter::encode

*** mutation diff:
--- crates/s4logs-core/src/chunk.rs
+++ replace += with *= in ChunkWriter::encode
@@ -176,17 +176,17 @@
                 original_size: self.pending.len() as u64,
                 compressed_offset: body.len() as u64,
                 compressed_size: compressed.len() as u64,
             });
             ts_entries.push(TsEntry {
                 min_ts: self.pending_min_ts,
                 max_ts: self.pending_max_ts,
             });
-            original_off += self.pending.len() as u64;
+            original_off *= /* ~ changed by cargo-mutants ~ */ self.pending.len() as u64;
             body.extend_from_slice(&compressed);
             record_count += self.pending_records;
             min_ts = min_ts.min(self.pending_min_ts);
             max_ts = max_ts.max(self.pending_max_ts);
         }
         if entries.is_empty() {
             return Ok(None);
         }

---- read::tests::coalesce_merges_adjacent_frames stdout ----

thread 'read::tests::coalesce_merges_adjacent_frames' (2421269) panicked at crates/s4logs-core/src/read.rs:364:9:
assertion `left == right` failed
  left: 6987
 right: 484190

---- chunk::tests::single_frame_roundtrips_via_plain_zstd stdout ----

thread 'chunk::tests::single_frame_roundtrips_via_plain_zstd' (2421261) panicked at crates/s4logs-core/src/chunk.rs:260:9:
assertion `left == right` failed
  left: 97
 right: 0

failures:
    chunk::tests::single_frame_roundtrips_via_plain_zstd
    read::tests::coalesce_merges_adjacent_frames

test result: FAILED. 41 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
