*** crates/s4logs-core/src/read.rs:112:5: replace decompress_frames -> Result<Vec<u8>, ReadError> with Ok(vec![1])

*** mutation diff:
--- crates/s4logs-core/src/read.rs
+++ replace decompress_frames -> Result<Vec<u8>, ReadError> with Ok(vec![1])
@@ -104,36 +104,17 @@
 /// NOTE: when called on a *coalesced* span that includes skipped gap bytes,
 /// pass the summed `original_size` of the member frames — gap frames decode
 /// too (they are whole zstd frames), so prefer exact spans for grep and use
 /// coalescing only when the caller filters records afterwards anyway.
 pub fn decompress_frames(input: &[u8], expected_original: u64) -> Result<Vec<u8>, ReadError> {
     // A forged sidecar/manifest can claim `expected_original` near u64::MAX;
     // a plain `+` would panic in debug and wrap in release. Reject anything
     // beyond a sane per-object ceiling before constructing the decoder.
-    if expected_original > MAX_DECOMPRESSED_BYTES {
-        return Err(ReadError::Bomb {
-            cap: MAX_DECOMPRESSED_BYTES,
-        });
-    }
-    let cap = expected_original.saturating_add(BOMB_SLACK_BYTES);
-    let decoder = zstd::stream::read::Decoder::new(input)?;
-    let mut limited = decoder.take(cap);
-    let mut out = Vec::with_capacity((expected_original as usize).min(BOOTSTRAP_CAPACITY));
-    limited.read_to_end(&mut out)?;
-    if out.len() as u64 >= cap {
-        return Err(ReadError::Bomb { cap });
-    }
-    if out.len() as u64 != expected_original {
-        return Err(ReadError::SizeMismatch {
-            expected: expected_original,
-            got: out.len() as u64,
-        });
-    }
-    Ok(out)
+    Ok(vec![1]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Streaming iterator over decompressed JSONL bytes: one [`LogRecord`] per
 /// non-empty line (grep/restore decode frame-by-frame and must not
 /// materialize a `Vec<LogRecord>` per multi-MiB frame). The final line may
 /// lack a trailing `\n`; empty lines are skipped rather than treated as
 /// parse errors so `split`-style padding can't poison a frame.
 #[derive(Debug, Clone)]

---- read::tests::huge_expected_original_rejected_not_overflow stdout ----

thread 'read::tests::huge_expected_original_rejected_not_overflow' (2743142) panicked at crates/s4logs-core/src/read.rs:223:52:
called `Result::unwrap_err()` on an `Ok` value: [1]

---- read::tests::prune_then_decompress_selected_frames stdout ----

thread 'read::tests::prune_then_decompress_selected_frames' (2743145) panicked at crates/s4logs-core/src/read.rs:189:13:
assertion `left == right` failed
  left: 1
 right: 210

---- read::tests::decompress_cap_boundary_rejects_at_exactly_cap stdout ----

thread 'read::tests::decompress_cap_boundary_rejects_at_exactly_cap' (2743141) panicked at crates/s4logs-core/src/read.rs:329:57:
called `Result::unwrap_err()` on an `Ok` value: [1]

failures:
    read::tests::bomb_cap_stops_decoding_early
    read::tests::decompress_cap_boundary_rejects_at_exactly_cap
    read::tests::huge_expected_original_rejected_not_overflow
    read::tests::prune_then_decompress_selected_frames
    read::tests::undersized_claim_within_cap_rejected_as_size_mismatch

test result: FAILED. 38 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
