*** crates/s4logs-core/src/read.rs:154:9: replace <impl Iterator for RecordLines<'_>>::next -> Option<Self::Item> with None

*** mutation diff:
--- crates/s4logs-core/src/read.rs
+++ replace <impl Iterator for RecordLines<'_>>::next -> Option<Self::Item> with None
@@ -146,29 +146,17 @@
         Self { rest: bytes }
     }
 }
 
 impl Iterator for RecordLines<'_> {
     type Item = Result<LogRecord, RecordError>;
 
     fn next(&mut self) -> Option<Self::Item> {
-        loop {
-            if self.rest.is_empty() {
-                return None;
-            }
-            let (line, rest) = match self.rest.iter().position(|&b| b == b'\n') {
-                Some(i) => (&self.rest[..i], &self.rest[i + 1..]),
-                None => (self.rest, &self.rest[..0]),
-            };
-            self.rest = rest;
-            if !line.is_empty() {
-                return Some(LogRecord::from_jsonl(line));
-            }
-        }
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 #[allow(clippy::unwrap_used)]
 mod tests {
     use super::*;
     use crate::chunk::{ChunkConfig, ChunkWriter};

---- read::tests::record_lines_streams_records_and_skips_blank_lines stdout ----

thread 'read::tests::record_lines_streams_records_and_skips_blank_lines' (2775129) panicked at crates/s4logs-core/src/read.rs:261:9:
assertion `left == right` failed
  left: 0
 right: 3

---- read::tests::record_lines_surfaces_parse_errors stdout ----

thread 'read::tests::record_lines_surfaces_parse_errors' (2775130) panicked at crates/s4logs-core/src/read.rs:274:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    read::tests::record_lines_streams_records_and_skips_blank_lines
    read::tests::record_lines_surfaces_parse_errors

test result: FAILED. 41 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
