*** crates/s4logs-core/src/read.rs:163:16: delete ! in <impl Iterator for RecordLines<'_>>::next

*** mutation diff:
--- crates/s4logs-core/src/read.rs
+++ delete ! in <impl Iterator for RecordLines<'_>>::next
@@ -155,17 +155,17 @@
             if self.rest.is_empty() {
                 return None;
             }
             let (line, rest) = match self.rest.iter().position(|&b| b == b'\n') {
                 Some(i) => (&self.rest[..i], &self.rest[i + 1..]),
                 None => (self.rest, &self.rest[..0]),
             };
             self.rest = rest;
-            if !line.is_empty() {
+            if  /* ~ changed by cargo-mutants ~ */line.is_empty() {
                 return Some(LogRecord::from_jsonl(line));
             }
         }
     }
 }
 
 #[cfg(test)]
 #[allow(clippy::unwrap_used)]

---- read::tests::record_lines_surfaces_parse_errors stdout ----

thread 'read::tests::record_lines_surfaces_parse_errors' (2794291) panicked at crates/s4logs-core/src/read.rs:286:9:
assertion `left == right` failed
  left: 0
 right: 2

---- read::tests::record_lines_streams_records_and_skips_blank_lines stdout ----

thread 'read::tests::record_lines_streams_records_and_skips_blank_lines' (2794289) panicked at crates/s4logs-core/src/read.rs:272:85:
called `Result::unwrap()` on an `Err` value: Decode(Error("EOF while parsing a value", line: 1, column: 0))

failures:
    read::tests::record_lines_streams_records_and_skips_blank_lines
    read::tests::record_lines_surfaces_parse_errors

test result: FAILED. 41 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
