*** crates/s4logs-core/src/read.rs:54:34: replace != with == in frames_overlapping

*** mutation diff:
--- crates/s4logs-core/src/read.rs
+++ replace != with == in frames_overlapping
@@ -46,17 +46,17 @@
 }
 
 /// Frames whose S4LT timestamp range overlaps `range`, in object order.
 pub fn frames_overlapping(
     frame_index: &FrameIndex,
     ts_index: &TsIndex,
     range: &TimeRange,
 ) -> Result<Vec<FrameSpan>, ReadError> {
-    if frame_index.entries.len() != ts_index.entries.len() {
+    if frame_index.entries.len() == /* ~ changed by cargo-mutants ~ */ ts_index.entries.len() {
         return Err(ReadError::IndexMismatch {
             frames: frame_index.entries.len(),
             ts_frames: ts_index.entries.len(),
         });
     }
     Ok(frame_index
         .entries
         .iter()

---- read::tests::prune_then_decompress_selected_frames stdout ----

thread 'read::tests::prune_then_decompress_selected_frames' (2641817) panicked at crates/s4logs-core/src/read.rs:202:85:
called `Result::unwrap()` on an `Err` value: IndexMismatch { frames: 34, ts_frames: 34 }

---- read::tests::coalesce_merges_adjacent_frames stdout ----

thread 'read::tests::coalesce_merges_adjacent_frames' (2641811) panicked at crates/s4logs-core/src/read.rs:359:85:
called `Result::unwrap()` on an `Err` value: IndexMismatch { frames: 34, ts_frames: 34 }

---- read::tests::mismatched_sidecars_rejected stdout ----

thread 'read::tests::mismatched_sidecars_rejected' (2641814) panicked at crates/s4logs-core/src/read.rs:221:9:
assertion failed: matches!(frames_overlapping(&chunk.frame_index, &ts, &range),
    Err(ReadError::IndexMismatch { .. }))

failures:
    read::tests::coalesce_merges_adjacent_frames
    read::tests::mismatched_sidecars_rejected
    read::tests::prune_then_decompress_selected_frames

test result: FAILED. 40 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
