*** crates/s4logs-core/src/read.rs:54:5: replace frames_overlapping -> Result<Vec<FrameSpan>, ReadError> with Ok(vec![])

*** mutation diff:
--- crates/s4logs-core/src/read.rs
+++ replace frames_overlapping -> Result<Vec<FrameSpan>, ReadError> with Ok(vec![])
@@ -46,35 +46,17 @@
 }
 
 /// Frames whose S4LT timestamp range overlaps `range`, in object order.
 pub fn frames_overlapping(
     frame_index: &FrameIndex,
     ts_index: &TsIndex,
     range: &TimeRange,
 ) -> Result<Vec<FrameSpan>, ReadError> {
-    if frame_index.entries.len() != ts_index.entries.len() {
-        return Err(ReadError::IndexMismatch {
-            frames: frame_index.entries.len(),
-            ts_frames: ts_index.entries.len(),
-        });
-    }
-    Ok(frame_index
-        .entries
-        .iter()
-        .zip(ts_index.entries.iter())
-        .enumerate()
-        .filter(|(_, (_, ts))| range.overlaps(ts.min_ts, ts.max_ts))
-        .map(|(i, (fe, _))| FrameSpan {
-            frame_idx: i,
-            byte_start: fe.compressed_offset,
-            byte_end_exclusive: fe.compressed_end(),
-            original_size: fe.original_size,
-        })
-        .collect())
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Merge spans whose gap is ≤ `max_gap_bytes` into fewer Range GETs.
 /// Input must be in object order (as produced by [`frames_overlapping`]).
 /// Returns `(byte_start, byte_end_exclusive, total_original_size)` tuples.
 pub fn coalesce_spans(spans: &[FrameSpan], max_gap_bytes: u64) -> Vec<(u64, u64, u64)> {
     let mut out: Vec<(u64, u64, u64)> = Vec::new();
     for s in spans {

---- read::tests::mismatched_sidecars_rejected stdout ----

thread 'read::tests::mismatched_sidecars_rejected' (2615393) panicked at crates/s4logs-core/src/read.rs:203:9:
assertion failed: matches!(frames_overlapping(&chunk.frame_index, &ts, &range),
    Err(ReadError::IndexMismatch { .. }))

---- read::tests::prune_then_decompress_selected_frames stdout ----

thread 'read::tests::prune_then_decompress_selected_frames' (2615395) panicked at crates/s4logs-core/src/read.rs:185:9:
assertion failed: !spans.is_empty()

---- read::tests::coalesce_merges_adjacent_frames stdout ----

thread 'read::tests::coalesce_merges_adjacent_frames' (2615390) panicked at crates/s4logs-core/src/read.rs:343:9:
assertion `left == right` failed: contiguous frames must merge
  left: 0
 right: 1

failures:
    read::tests::coalesce_merges_adjacent_frames
    read::tests::mismatched_sidecars_rejected
    read::tests::prune_then_decompress_selected_frames

test result: FAILED. 40 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
