*** crates/s4logs-core/src/read.rs:79:5: replace coalesce_spans -> Vec<(u64, u64, u64)> with vec![(0, 0, 1)]

*** mutation diff:
--- crates/s4logs-core/src/read.rs
+++ replace coalesce_spans -> Vec<(u64, u64, u64)> with vec![(0, 0, 1)]
@@ -71,27 +71,17 @@
         })
         .collect())
 }
 
 /// Merge spans whose gap is ≤ `max_gap_bytes` into fewer Range GETs.
 /// Input must be in object order (as produced by [`frames_overlapping`]).
 /// Returns `(byte_start, byte_end_exclusive, total_original_size)` tuples.
 pub fn coalesce_spans(spans: &[FrameSpan], max_gap_bytes: u64) -> Vec<(u64, u64, u64)> {
-    let mut out: Vec<(u64, u64, u64)> = Vec::new();
-    for s in spans {
-        match out.last_mut() {
-            Some((_, end, orig)) if s.byte_start.saturating_sub(*end) <= max_gap_bytes => {
-                *end = s.byte_end_exclusive;
-                *orig += s.original_size;
-            }
-            _ => out.push((s.byte_start, s.byte_end_exclusive, s.original_size)),
-        }
-    }
-    out
+    vec![(0, 0, 1)] /* ~ changed by cargo-mutants ~ */
 }
 
 /// How much slack the bomb cap allows over the sidecar-claimed size
 /// (mirrors s4 `cpu_zstd.rs`).
 pub const BOMB_SLACK_BYTES: u64 = 1024;
 const BOOTSTRAP_CAPACITY: usize = 1 << 20;
 /// Hard ceiling on a single object's decompressed size (64 GiB). A claimed
 /// `expected_original` above this is treated as a hostile sidecar — real log

---- read::tests::coalesce_gap_threshold_is_inclusive stdout ----

thread 'read::tests::coalesce_gap_threshold_is_inclusive' (2662939) panicked at crates/s4logs-core/src/read.rs:320:9:
assertion `left == right` failed: gap > max stays split
  left: 1
 right: 2

---- read::tests::coalesce_merges_adjacent_frames stdout ----

thread 'read::tests::coalesce_merges_adjacent_frames' (2662940) panicked at crates/s4logs-core/src/read.rs:353:9:
assertion `left == right` failed
  left: 0
 right: 3121

failures:
    read::tests::coalesce_gap_threshold_is_inclusive
    read::tests::coalesce_merges_adjacent_frames

test result: FAILED. 41 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
